{"intents": [{"tag": "REASONS_FOR_ALLOWANCE", "patterns": ["REASONS FOR ALLOWANCE"], "responses": ["Reasons for allowance. If the examiner believes that the record of the prosecution as a whole does not make clear his or her reasons for allowing a claim or claims, the examiner may set forth such reasoning. The reasons shall be incorporated into an Office action rejecting other claims of the application or patent under reexamination or be the subject of a separate communication to the applicant or patent owner. The applicant or patent owner may file a statement commenting on the reasons for allowance within such time as may be specified by the examiner. Failure by the examiner to respond to any statement commenting on reasons for allowance does not give rise to any implication.\n        <a target=\"_new\" href=\"https://www.uspto.gov/web/offices/pac/mpep/s1302.html#d0e132661\">More information</a>"]}, {"tag": "MPEP_LINK", "patterns": ["MPEP LINK", "LINK TO MPEP", "MANUAL OF PATENT EXAMINING PROCEDURE LINK"], "responses": ["Here you go: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current\">MPEP</a>"]}, {"tag": "WOLCOTT", "patterns": ["WOLCOTT"], "responses": ["MPEP has a heritage dating back to 1920 to what became known as \"Wolcott's Manual\". \"One of the most fruitful endeavors of the [Patent and Trademark Office] Society in the area of education was the publication of the first Manual of Patent Office Procedure. The first Manual was written by two employees of the Office and was published in 1920 by the Society. This Manual, with its eight revisions, often referred to as Wolcott's Manual, was the only procedural manual available until 1949 when the Patent Office assumed the publication of the Manual of Patent Examining Procedure.\"\n        Since 1920 the Manual and predecessor publication known as \"Wolcott's Manual\" have been the primary guidance for the Patent Examiner as to everything procedural going on at the Patent Office. In fact, the Manual was not a brand new endeavor but, rather, the continuation of the work of Clinton Leroy Wolcott who was the author of the major procedural work of the then Patent Office Society (later restyled as the Patent and Trademark Office Society), a voluntary professional organization comprised of Commerce Department employees."]}, {"tag": "NON_FINAL_REJECTION", "patterns": ["NON FINAL REJECTION"], "responses": ["Please refer to <a target=\"_new\" href=\"https://www.uspto.gov/web/offices/pac/mpep/s2266.html#d0e231548\">NON FINAL REJECTION</a>"]}, {"tag": "HOW_MANY_PAGES_IN_THE_MPEP", "patterns": ["HOW MANY PAGES IN THE MPEP", "HOW LONG IS MPEP"], "responses": ["Over 3000 pages."]}, {"tag": "HOW_DO_I_EXAMINE_A_PATENT", "patterns": ["HOW DO I EXAMINE A PATENT", "WHAT IS EXAMINATION OF A PATENT"], "responses": ["This seems like a good write up: <a target=\"_new\" href=\"http://www.coconutheadphones.com/googles-patent-applications-how-to-examine-them-yourself/\">Googles Patent Applications and How to Examine them yourself</a>"]}, {"tag": "ALLOWANCE", "patterns": ["ALLOWANCE", "ISSUE"], "responses": ["You can find more information here <a target=\"_new\" href=\"https://www.uspto.gov/web/offices/pac/mpep/s1303.html\">ALLOWANCE</a>"]}, {"tag": "CAN_I_DO_A_2ND_ACTION_NON_FINAL", "patterns": ["CAN I DO A 2ND ACTION NON FINAL"], "responses": ["Not to my knowledge."]}, {"tag": "REQUIREMENT_FOR_INFORMATION", "patterns": ["REQUIREMENT FOR INFORMATION", "105", "RULE 105", "RULE 1.105"], "responses": ["Refer to this article: <a target=\"_new\" href=\"https://www.uspto.gov/web/offices/pac/mpep/s704.html\">37 CFR 1.105  Requirements for information</a>"]}, {"tag": "FIRST_TO_FILE", "patterns": ["FIRST TO FILE"], "responses": ["In a first-to-file system, the right to the grant of a patent for a given invention lies with the first person to file a patent application for protection of that invention, regardless of the date of actual invention."]}, {"tag": "FIRST_TO_DISCLOSE", "patterns": ["FIRST TO DISCLOSE"], "responses": ["The concept of a \"grace\" period, under which early disclosure does not prevent the discloser from later filing and obtaining a patent, must be distinguished here from the FTI system. Germany and the UK formerly had a concept of grace period. Both FTI and grace period systems afforded the early discloser protection against later filers. The FTI system allowed non-disclosers to overturn established parties, whereas the grace system only protects early disclosers. The US moved to a grace system on 16 March 2013, which has been termed \"first-to-disclose\" by some writers"]}, {"tag": "FIRST_TO_INVENT", "patterns": ["FIRST TO INVENT"], "responses": ["Canada, the Philippines, and the United States had been among the only countries to use first-to-invent systems, but each switched to first-to-file in 1989, 1998, and 2013 respectively.\n\n        Invention in the U.S. is generally defined to comprise two steps: (1) conception of the invention and (2) reduction to practice of the invention. When an inventor conceives of an invention and diligently reduces the invention to practice (by filing a patent application, by practicing the invention, etc.), the inventor's date of invention will be the date of conception. Thus, provided an inventor is diligent in actually reducing an application to practice, he or she will be the first inventor and the inventor entitled to a patent, even if another files a patent application, constructively reducing the invention to practice, before the inventor.\n\n        However, the first applicant to file has the prima facie right to the grant of a patent. Under the first-to-invent system, when two people claim the same invention, the USPTO would conduct an interference proceeding between them to review evidence of conception, reduction to practice and diligence. Interference can be an expensive and time-consuming process."]}, {"tag": "PLACEHOLDER", "patterns": ["PLACEHOLDER"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://rdms-mpep-vip.uspto.gov/RDMS/MPEP/current#/result/d0e219279.html?q=placeholder&ccb=on&ncb=off&icb=off&fcb=off&ver=current&syn=adj&results=compact&sort=relevance&cnt=10&index=3\">Placeholder reference</a>"]}, {"tag": "FILTER_AS_PLACEHOLDER_TERM", "patterns": ["FILTER AS PLACEHOLDER TERM"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://rdms-mpep-vip.uspto.gov/RDMS/MPEP/current#/result/d0e219279.html?q=112(f)&ccb=on&ncb=off&icb=off&fcb=off&ver=current&syn=adj&results=compact&sort=relevance&cnt=10&index=3\">Filter as placeholder term</a>"]}, {"tag": "PLACEHOLDER_TERM_SUGGEST_INVOCATION_OF_112F", "patterns": ["PLACEHOLDER TERM SUGGEST INVOCATION OF 112F", "PLACEHOLDER TERMS SUGGEST INVOCATION OF 112F"], "responses": ["MPEP 2181 also Refer to this guide: <a target=\"_new\" href=\"https://rdms-mpep-vip.uspto.gov/RDMS/MPEP/current#/result/d0e219279.html?q=generic%20placeholder&ccb=on&ncb=off&icb=off&fcb=off&ver=current&syn=adj&results=compact&sort=relevance&cnt=10&index=2\">Reference</a>"]}, {"tag": "DUTY_TO_DISCLOSURE", "patterns": ["DUTY TO DISCLOSURE", "CANDOR", "GOOD FAITH"], "responses": ["MPEP 2181 also Refer to this guide: <a target=\"_new\" href=\"https://www.uspto.gov/web/offices/pac/mpep/s2001.html\">Duty to disclosure</a>"]}, {"tag": "QUAYLE", "patterns": ["QUAYLE"], "responses": ["A Quayle action closes prosecution and is done when an application is in condition for allowance save for minor, typically typographical type, errors"]}, {"tag": "FINAL_ACTION", "patterns": ["FINAL ACTION"], "responses": ["MPEP 2181 also Refer to this guide: <a target=\"_new\" href=\"https://www.uspto.gov/web/offices/pac/mpep/s2271.html\">Final Action</a>"]}, {"tag": "PERIOD_FOR_RESPONSE", "patterns": ["PERIOD FOR RESPONSE", "RESPONSE TIME PERIOD"], "responses": ["MPEP 2181 also Refer to this guide: <a target=\"_new\" href=\"https://www.uspto.gov/trademarks-getting-started/process-overview/response-time-period\">Response Time Period</a>"]}, {"tag": "PATENTABLE", "patterns": ["PATENTABLE", "PATENTABILITY"], "responses": ["Section 101 of title 35, United States Code, provides: \"Whoever invents or discovers any new and useful process, machine, manufacture, or composition of matter, or any new and useful improvement thereof, may obtain a patent therefor, subject to the conditions and requirements of this title.\" <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e197004.html\">MPEP 2103</a>"]}, {"tag": "TYPES_OF_PATENTS", "patterns": ["TYPES OF PATENTS", "PATENT TYPES"], "responses": ["Patent applications can be directed to three broad types of subject matter: \n\n        (A) applications for patents as provided for by 35 U.S.C. 101  relating to a \"new and useful process, machine, manufacture, or composition of matter,\" etc.;\n        (B) applications for plant patents as provided for by 35 U.S.C. 161; and\n        (C) applications for design patents as provided for by 35 U.S.C. 171.\n        The first type of patent application is sometimes referred to as a \"utility\" patent applications when being contrasted with a plant or design patent application. The specialized procedure which pertains to the examination of applications for design and plant patents are treated in detail in Chapters 1500 and 1600, respectively. <a target=\"_new\" href=\"https://rdms-mpep-vip.uspto.gov/RDMS/MPEP/current#/current/d0e4510.html\">MPEP 201</a>"]}, {"tag": "INFORMATION_REASONABLY_REQUIRED", "patterns": ["INFORMATION REASONABLY REQUIRED", "REASONABLE REQUEST", "INFORMATION REQUEST", "REQUEST EXAMPLE"], "responses": ["37 CFR 1.105(a)(1)(i)-(viii)  list specific examples of information that may be reasonably required. Other examples, not meant to be exhaustive, of information that may be reasonably required for examination of an application include:\n\n        (A) The name and citation of any particularly relevant indexed journal, or treatise.\n        (B) The trade name of any goods or services the claimed subject matter is embodied in.\n        (C) The citation for, the dates initially published and copies of any advertising and promotional literature prepared for any goods or services the claimed subject matter has been embodied in.\n        (D) The citation for and copies of any journal articles describing any goods or services the claimed subject matter has been embodied in.\n        (E) The trade names and providers of any goods or services in competition with the goods or services the claimed subject matter has been embodied in.\n        (F) Any written descriptions or analyses, prepared by any of the inventors or assignees, of goods or services in competition with the goods or services the claimed subject matter has been embodied in.\n        (G) Identification of pending or abandoned applications filed by at least one of the inventors or assigned to the same assignee as the current application that disclose similar subject matter that are not otherwise identified in the current application. Regarding the identification of applications filed before June 8, 1995, 35 U.S.C. 122(a)  requires the identified applications to be kept in confidence by the Office and no information concerning the same is to be given without authority of the applicant or owner unless necessary to carry out the provisions of an Act of Congress or in such special circumstances as may be determined by the Director. See MPEP Â§ 103 and Hyatt v. United States Patent and Trademark Office, No. 1:13-cv-1535 (E.D. Va., May 29, 2014) (2014 WL 2446176).\n        (H) A reply to a matter raised in a protest under 37 CFR 1.291.\n        (I) An explanation of technical material in a publication, such as one of the inventorâ\u0080\u0099s publications.\n        (J) The identification of changes made in a reformatted continuing application filed under 37 CFR 1.53(b).\n        (K) A mark-up for a continuation-in-part application showing the subject matter added where there is an intervening reference.\n        (L) Comments on a new decision by the Federal Circuit that appears on point.\n        (M) The publication date of an undated document mentioned by applicant that may qualify as printed publication prior art (35 U.S.C. 102(a)  or pre-AIA 35 U.S.C. 102(a)  or (b) ).\n        (N) Comments on information of record which raises a question of whether applicant derived the invention from another under 35 U.S.C. 101  and 115, and pre-AIA 35 U.S.C. 102(f).\n        (O) Art related to applicantâ\u0080\u0099s invention, applicantâ\u0080\u0099s disclosure, or the claimed subject matter.\n        (P) Other factual information pertinent to patentability.\n        (Q) The accuracy of the examinerâ\u0080\u0099s stated analysis of such items.\n        (R) Clarification of the correlation and identification of what structure, material, or acts set forth in the specification would be capable of carrying out a function recited in a means or steps plus function claim limitation. If it is not apparent to the examiner where in the specification and drawings there is support for a particular claim limitation reciting a means to accomplish a function, and if an inquiry by the examiner for such support is met by a stated lack of knowledge thereof by the applicant, the examiner could very well conclude that there is no such support and make appropriate rejections under, for example, 35 U.S.C. 112(a)  or pre-AIA 35 U.S.C. 112, first paragraph (written description) and 35 U.S.C. 112(b)  or pre-AIA 35 U.S.C. 112, second paragraph.\n        (S) Interrogatories or Stipulations.\n            (1) Of the common technical features shared among all claims, or admission that certain groups of claims do not share any common technical features,\n            (2) About the support found in the disclosure for means or steps plus function claims (35 U.S.C. 112(f)  or pre-AIA 35 U.S.C. 112, paragraph 6),\n            (3) Of precisely which portion(s) of the disclosure provide the written description and enablement support for specific claim element(s),\n            (4) Of the meaning of claim limitations or terms used in the claims, such as what teachings in the prior art would be covered by particular limitations or terms in a claim and which dictionary definitions would define a particular claim term, particularly where those terms are not used per se in the specification,\n            (5) Of which portions of each claim correspond to any admitted prior art in the specification,\n            (6) Of the specific utility provided by the claimed subject matter on a claim-by-claim basis,\n            (7) As to whether a dependent claim element is known in the prior art based on the examiner having a reasonable basis for believing so,\n            (8) Of support for added limitations in an amended claim,\n            (9) Of facts related to public use or sale situations.\n        (T) Information from the applicant regarding a third party submission under 37 CFR 1.290. In no circumstance may an examiner direct a requirement for information to the third party that submitted the paper under 37 CFR 1.290. See MPEP Â§ 1134.\n        (U) Information from the applicant regarding rescission of a statement under 37 CFR 1.55  or 1.78. See MPEP Â§ 704.14(a) for form paragraph 7.104.02."]}, {"tag": "PROCESS", "patterns": ["PROCESS", "PROCESS"], "responses": ["Process means process, art, or method. Includes a new use for a known process, machine, manufacture, composition of matter, or material. A process is a series of steps"]}, {"tag": "EFFECTIVE_FILING_DATE", "patterns": ["EFFECTIVE FILING DATE", "EFFECTIVE FILING DATE"], "responses": ["The filing date of the earliest prior-filed U.S. application or international (PCT) application designating the U.S. that is identified in a valid domestic benefit claim"]}, {"tag": "INFORMAL", "patterns": ["INFORMAL", "INSUFFICIENT"], "responses": ["Section 702.01 of the MPEP - Obviously Informal Cases:\n        When an application is taken up for examination and it is then discovered to be impractical to give a complete action on the merits because of an informal or insufficient disclosure, the following procedure may be followed:\n\n            (A) A reasonable search should be made of the invention so far as it can be understood from the disclosure, objects of invention and claims and any apparently pertinent art cited. In the rare case in which the disclosure is so incomprehensible as to preclude a reasonable search, the Office action should clearly inform applicant that no search was made;\n            (B) Any form that lists informalities and any additional formal requirements to be made should be included in the first Office action (see MPEP Â§ 707.07(a));\n            (C) A requirement should be made that the specification be revised to conform to idiomatic English and United States patent practice;\n            (D) The claims should be rejected as failing to define the invention in the manner required by 35 U.S.C. 112  if they are informal. A blanket rejection is usually sufficient.\n\n        The examiner should attempt to point out the points of informality in the specification and claims. The burden is on the applicant to revise the application to render it in proper form for a complete examination."]}, {"tag": "TERMINOLOGY", "patterns": ["TERMINOLOGY"], "responses": ["Section 702.01 of the MPEP - Use of Unconventional Terminology, Cannot Be Examined: \n        A preliminary examination of this application reveals that it includes terminology which is so different from that which is generally accepted in the art to which this invention pertains that a proper search of the prior art cannot be made. \n\n        Applicant is required to provide a clarification of these matters or correlation with art-accepted terminology so that a proper comparison with the prior art can be made. Applicant should be careful not to introduce any new matter into the disclosure (i.e., matter which is not supported by the disclosure as originally filed).\n        A shortened statutory period for reply to this action is set to expire TWO MONTHS from the mailing date of this letter.\n\n        Use form paragraph 7.02 where the application is so incomprehensible that a reasonable search cannot be made."]}, {"tag": "INCOMPREHENSIBLE", "patterns": ["INCOMPREHENSIBLE", "CONFUSING"], "responses": ["Section 702.01 of the MPEP - Disclosure Is Incomprehensible: \n        The disclosure is objected to under 37 CFR 1.71, as being so incomprehensible as to preclude a reasonable search of the prior art by the examiner. \n\n        Applicant is required to submit an amendment which clarifies the disclosure so that the examiner may make a proper comparison of the invention with the prior art.\n        Applicant should be careful not to introduce any new matter into the disclosure (i.e., matter which is not supported by the disclosure as originally filed).\n        A shortened statutory period for reply to this action is set to expire TWO MONTHS from the mailing date of this letter.\n\n        For the procedure to be followed when the drawing is not acceptable, see MPEP Â§Â§ 608.02(a) and 608.02(b)."]}, {"tag": "PATENTABILITY_REPORT", "patterns": ["PATENTABILITY REPORT", "P.R."], "responses": ["Section 705 of the MPEP - Patentability Reports: \n        Where an application, properly assigned to one Technology Center (TC), is found to contain one or more claims, per se, classifiable in one or more other TCs, which claims are not divisible inter se or from the claims which govern classification of the application in the first TC, the application may be referred to the other TC(s) concerned for a report as to the patentability of certain designated claims. This report is known as a Patentability Report (P.R.) and is signed by the primary examiner in the reporting TC.\n        Note that the Patentability Report practice is only to be used in extraordinary circumstances. See MPEP Â§ 705.01(e)."]}, {"tag": "PROVISIONAL_REJECTION", "patterns": ["PROVISIONAL REJECTION"], "responses": ["Section 715 of the MPEP - Provisional Rejection:\n        Claim(s) is/are provisionally rejected under 35 U.S.C. 102(a)(2)  as being anticipated by copending Application No. which has a common with the instant application.\n\n        Based upon the earlier effective filing date of the copending application, it would constitute prior art under 35 U.S.C. 102(a)(2), if published under 35 U.S.C. 122(b)  or patented under 35 U.S.C. 151. This provisional rejection under 35 U.S.C. 102(a)(2)  is based upon a presumption of future publication or patenting of the copending application. [4]."]}, {"tag": "COMMON_OWNER", "patterns": ["COMMON OWNER", "JOINT OWNER", "JOINT RESEARCH"], "responses": ["Section 706.02(l)(2) of the MPEP - Establishing Common Ownership or Joint Research:\n        The term \"commonly owned\" is intended to mean that the subject matter which would otherwise be prior art to the claimed invention and the claimed invention are entirely or wholly owned by, or under an obligation to assign to, the same person(s) or organization(s)/business entity(ies)\n\n        As long as principal ownership rights to either the subject matter or the claimed invention under examination reside in different persons or organizations common ownership does not exist. A license of the claimed invention under examination to another by the owner where basic ownership rights are retained would not defeat ownership"]}, {"tag": "OBVIOUSNESS", "patterns": ["OBVIOUSNESS"], "responses": ["The factual inquiries set forth in Graham v. John Deere Co., 383 U.S. 1, 148 USPQ 459 (1966), that are applied for establishing a background for determining obviousness under 35 U.S.C. 103  are summarized as follows:\n            1. Determining the scope and contents of the prior art. \n            2. Ascertaining the differences between the prior art and the claims at issue.\n            3. Resolving the level of ordinary skill in the pertinent art.\n            4. Considering objective evidence present in the application indicating obviousness or nonobviousness."]}, {"tag": "HUMAN", "patterns": ["HUMAN"], "responses": ["Section 33(a) of the America Invents Act reads as follows:\n            Notwithstanding any other provision of law, no patent may issue on a claim directed to or encompassing a human organism.\n        Claim rejected under 35 U.S.C. 101  and section 33(a) of the America Invents Act as being directed to or encompassing a human organism. See also Animals - Patentability, 1077 Off. Gaz. Pat. Office 24 (April 21, 1987) (indicating that human organisms are excluded from the scope of patentable subject matter under 35 U.S.C. 101 )."]}, {"tag": "ATOMIC", "patterns": ["ATOMIC", "NUCLEAR"], "responses": ["Section 706.03(b) of the MPEP - Barred by Atomic Energy Act:\n        A limitation on what can be patented is imposed by the Atomic Energy Act of 1954. Section 151(a) (42 U.S.C. 2181(a)) thereof reads in part as follows:\n            No patent shall hereafter be granted for any invention or discovery which is useful solely in the utilization of special nuclear material or atomic energy in an atomic weapon.\n        All rejections based upon sections 151(a)(42 U.S.C. 2181(a)), 152 (42 U.S.C. 2182), and 155 (42 U.S.C. 2185) of the Atomic Energy Act must be made only by TC work group 3640 personnel."]}, {"tag": "INDEFINITE", "patterns": ["INDEFINITE"], "responses": ["Form Paragraph 7.34.01 in the MPEP: Failure To Particularly Point out and Distinctly Claim (Indefinite)\n        Claim rejected under 35 U.S.C. 112(b)  or pre-AIA 35 U.S.C. 112, second paragraph, as being indefinite for failing to particularly point out and distinctly claim the subject matter which the inventor or a joint inventor, or for pre-AIA the applicant regards as the invention.\n\n        This can include direct foreign language translations, terminology inconsistent with accepted meaning, broad and narrow range/limitation in the same claim, or language including \"for example,\" \"or the like,\" or \"such as.\""]}, {"tag": "ORDER", "patterns": ["ORDER", "PRIORITY"], "responses": ["Section 708 in the MPEP - Order of Examination:\n        Each examiner will give priority to that application in his or her docket, whether amended or new, which has the oldest effective U.S. filing date. This basic policy applies to all applications; rare circumstances may justify TC Directors granting individual exceptions.\n\n        Applications which have been acted upon by the examiner, and which have been placed by the applicant in condition for further action by the examiner (amended applications) shall be taken up for action in such order as shall be determined by the Director of the USPTO.\n\n        All amendments before final rejection should be responded to within two months of receipt."]}, {"tag": "SUSPENSION", "patterns": ["SUSPENSION"], "responses": ["Section 709 in the MPEP - Sespension of Examination:\n        On request of the applicant, the Office may grant a suspension of action by the Office under this paragraph for good and sufficient cause. Suspension of action (37 CFR 1.103 ) should not be confused with extension of time for reply (37 CFR 1.136 ).\n\n        A request that action in an application be delayed will be granted only under the provisions of 37 CFR 1.103, which provides for \"Suspension of Action.\" A petition for suspension of action under 37 CFR 1.103(a)  must:\n\t\t\t(A) be presented as a separate paper;\n\t\t\t(B) be accompanied by the petition fee set forth in 37 CFR 1.17(g);\n\t\t\t(C) request a specific and reasonable period of suspension not greater than 6 months; and\n\t\t\t(D) present good and sufficient reasons why the suspension is necessary."]}, {"tag": "DEFERRAL", "patterns": ["DEFERRAL"], "responses": ["Section 709 C in the MPEP - Request for Deferral of Examination: \n        In new applications, applicants may request a deferral of examination under 37 CFR 1.103(d)  for a period not extending beyond three years from the earliest filing date for which a benefit is claimed under 35 U.S.C. 119(a)-(d), (e), (f), 120, 121, 365, or 386. The request must be filed before the Office issues an Office action under 35 U.S.C. 132  or a notice of allowance in the application"]}, {"tag": "REPLY", "patterns": ["REPLY"], "responses": ["Section 710 in the MPEP - Period for Reply:\n        The maximum statutory period for reply to an Office action is 6 months. 35 U.S.C. 133. Shortened periods are currently used in practically all cases. See MPEP Â§ 710.02(b).\n\t\t37 CFR 1.135  provides that if no reply is filed within the time set in the Office action under 37 CFR 1.134  or as it may be extended under 37 CFR 1.136, the application will be abandoned unless an Office action indicates otherwise.\n\t\t37 CFR 1.136  implements 35 U.S.C. 41(a)(8)  which directs the Director of the USPTO to charge fees for extensions of time to take action in patent applications."]}, {"tag": "ABANDONMENT", "patterns": ["ABANDONMENT", "FAILURE", "TERMINATION", "TERMINATE"], "responses": ["Section 711 in the MPEP - Abandonment of Patent Application:\n        ThAbandonment may be either of the invention or of an application. This discussion is concerned with abandonment of the application for patent.\n\t\tAn abandoned application, in accordance with 37 CFR 1.135  and 1.138, is one which is removed from the Office docket of pending applications through:\n\t\t\t(A) formal abandonment\n\t\t\t(B) failure of applicant to take appropriate action within a specified time at some stage in the prosecution of the application.\n\t\tThe procedure available for reviving an application that has become abandoned due to a failure to reply to an Office Action is a petition under 37 CFR 1.137(a)  based on unintentional delay.\n\t\t\n\t\t37 CFR 1.137  provides for the revival of abandoned applications, or terminated or limited reexamination prosecution on the basis of unintentional delay for the failure:\n\t\t\t(A) to timely reply to an Office requirement in a provisional application;\n\t\t\t(B) to timely prosecute in a nonprovisional application;\n\t\t\t(C) to timely pay the issue fee for a design application;\n\t\t\t(D) to timely pay the issue fee for a utility or plant application; and\n\t\t\t(E) to provide copendency between the abandoned application and a subsequently filed application."]}, {"tag": "INTERVIEW", "patterns": ["INTERVIEW", "MEET"], "responses": ["Section 713 in the MPEP - Interview:\n        An interview should be granted when the nature of the case is such that the interview serves to develop or clarify outstanding issues in an application. \n\n        All discussions between the applicant/practitioner and the examiner regarding the merits of a pending application will be considered an interview and are to be made of record. This includes any and all records or communications received in connection with the interview, whether the interview was conducted in-person or through a telephone conversation, video conference, electronic mail, or electronic message system. This policy and other interview tips are detailed in the Interview Best Practices document which is available at <a target=\"_new\" href=\"www.uspto.gov/patents/law/exam/interview_ best_ practices.pdf\">www.uspto.gov/patents/law/exam/interview_ best_ practices.pdf</a>\n\n        Interviews that are solely for the purpose of \"sounding out\" the examiner, as by a local attorney acting for an out-of-town attorney, should not be permitted when it is apparent that any agreement that would be reached is conditional upon being satisfactory to the principal attorney.\n        Normally, one interview after final rejection is permitted in order to place the application in condition for allowance or to resolve issues prior to appeal."]}, {"tag": "AMEND", "patterns": ["AMEND", "CHANGE", "MODIFY"], "responses": ["Section 714 in the MPEP - Amendments, Applicantâ\u0080\u0099s Action:\n        The applicant may amend:\n\t\t\t(A) ) before or after the first Office action and also after the second Office actions as specified in 37 CFR 1.112;\n\t\t\t(B) after final rejection, if the amendment meets the criteria of 37 CFR 1.116;  \n\t\t\t(C) after the date of filing a notice of appeal pursuant to 37 CFR 41.31(a), if the amendment meets the criteria of 37 CFR 41.33; and\n\t\t\t(D) when and as specifically required by the examiner. \n\t\tAmendments in provisional applications are not normally made. If an amendment is made to a provisional application, however, it must comply with the provisions of 37 CFR 1.121. \n\t\tAn amendment must be signed by a person having authority to prosecute the application. An unsigned or improperly signed amendment will not be entered. See MPEP Â§ 714.01(a).\n\t\tActions by applicant, especially those filed near the end of the period for reply, should be reviewed as soon as possible upon becoming available to the examiner to determine whether they are completely responsive to the preceding Office action so as to prevent abandonment of the application"]}, {"tag": "SWEAR", "patterns": ["SWEAR", "OATH"], "responses": ["Section 715 in the MPEP - Swearing Behind a Reference â\u0080\u0094 Affidavit or Declaration Under 37 CFR 1.131(a):\n        When any claim of an application or a patent under reexamination is rejected, the inventor of the subject matter of the rejected claim, the owner of the patent under reexamination, or the party qualified under Â§ 1.42  or Â§ 1.46, may submit an appropriate oath or declaration to establish invention of the subject matter of the rejected claim prior to the effective date of the reference or activity on which the rejection is based.\n\n        Section 716 in the MPEP: Affidavits or Declarations Traversing Rejections, 37 CFR 1.132\n\n        Section 717.01 in the MPEP: Affidavit or Declaration Under 37 CFR 1.130\n\n        Section 718 in the MPEP:  Affidavit or Declaration to Disqualify Commonly Owned Patent as Prior Art, 37 CFR 1.131(c)"]}, {"tag": "WRAPPER", "patterns": ["WRAPPER"], "responses": ["Section 719 in the MPEP - File Wrapper:\n        The electronic file record in which the U.S. Patent and Trademark Office maintains the application papers is referred to as an image file wrapper. The electronic file record is the official record of the application.\n\n\t\tSee MPEP Â§ 202 for appropriate notations to be made in the file history with regard to claims for priority to, or the benefit of, earlier filed applications under 35 U.S.C. 119, 120, 121, 365, and 386."]}, {"tag": "PUBLIC_USE", "patterns": ["PUBLIC USE"], "responses": ["Section 720 in the MPEP - Public Use Proceedings:\n        Effective September 16, 2012, former 37 CFR. 1.292 authorizing petitions seeking institution of public use proceedings was removed from title 37. For information necessary regarding the former process, the August 2012 revision of the MPEP (www.uspto.gov/web/offices/pac/mpep/old/mpep_E8R9.htm ) may be consulted."]}, {"tag": "SECRET", "patterns": ["SECRET", "PROPRIETARY", "PROTECT"], "responses": ["Section 724 in the MPEP: Trade Secret, Proprietary, and Protective Order Materials [R-08.2012]\n        Parties bringing information to the attention of the Office for use in the examination of applications and reexaminations are frequently faced with the prospect of having legitimate trade secret, proprietary, or protective order material disclosed to the public.\n\n        It is incumbent upon patent applicants, therefore, to bring \"material\" information to the attention of the Office. It matters not whether the \"material\" information can be classified as a trade secret, or as proprietary material, or whether it is subject to a protective order. The obligation is the same; it must be disclosed if \"material to patentability\" as defined in 37 CFR 1.56(b). The same duty rests upon a patent owner under 37 CFR 1.555  whose patent is undergoing reexamination.\n\n\t\tSomewhat the same problem faces a protestor under 37 CFR 1.291(a)  who believes that trade secret, proprietary, or protective order material should be considered by the Office during the examination of an application.\n\t\tIn some circumstances, it may be possible to submit the information in such a manner that legitimate trade secrets, etc., will not be disclosed, e.g., by appropriate deletions of nonmaterial portions of the information. This should be done only where there will be no loss of information material to patentability under 37 CFR 1.56  or 1.555."]}, {"tag": "INDEPENDENT", "patterns": ["INDEPENDENT"], "responses": ["Section 802.01 in the MPEP - Meaning of \"Independent\" and \"Distinct:\"\n        The term \"independent\" (i.e., unrelated) means that there is no disclosed relationship between the two or more inventions claimed, that is, they are unconnected in design, operation, and effect. For example, a process and an apparatus incapable of being used in practicing the process are independent inventions. See also MPEP Â§ 806.06 and Â§ 808.01.\n\n        It is further noted that the terms \"independent\" and \"distinct\" are used in decisions with varying meanings. All decisions should be read carefully to determine the meaning intended."]}, {"tag": "DISTINCT", "patterns": ["DISTINCT"], "responses": ["Section 802.01 in the MPEP - Meaning of \"Independent\" and \"Distinct:\"\n        Related inventions are distinct if the inventions as claimed are not connected in at least one of design, operation, or effect (e.g., can be made by, or used in, a materially different process) and wherein at least one invention is PATENTABLE (novel and nonobvious) OVER THE OTHER (though they may each be unpatentable over the prior art).\n\n        It is further noted that the terms \"independent\" and \"distinct\" are used in decisions with varying meanings. All decisions should be read carefully to determine the meaning intended."]}, {"tag": "MARKUSH", "patterns": ["MARKUSH"], "responses": ["A Markush-type claim recites alternatives in a format such as \"selected from the group consisting of A, B and C.\" See Ex parte Markush, 1925 C.D. 126 (Commâ\u0080\u0099r Pat. 1925). The members of the Markush group (A, B, and C in the example above) ordinarily must belong to a recognized physical or chemical class or to an art-recognized class.However, when the Markush group occurs in a claim reciting a process or a combination (not a single compound), it is sufficient if the members of the group are disclosed in the specification to possess at least one property in common which is mainly responsible for their function in the claimed relationship.\n\n        Inventions in metallurgy, refractories, ceramics, pharmacy, pharmacology and biology are most frequently claimed under the Markush formula but purely mechanical features or process steps may also be claimed by using the Markush style of claiming. See MPEP Â§ 2173.05(h)"]}, {"tag": "COMMON_OWNERSHIP", "patterns": ["COMMON OWNERSHIP", "COMMONLY OWNED"], "responses": ["Section 804.03 in the MPEP - Commonly Owned Inventions of Different Inventive Entities; Non-Commonly Owned Inventions Subject to a Joint Research Agreement:\"\n        Applications or patents are \"commonly owned\" pursuant to 35 U.S.C. 102(b)(2)(C)  or pre-AIA 35 U.S.C. 103(c)(1)  if they were wholly or entirely owned by the same person(s), or organization(s)/business entity(ies), at the time the claimed invention was filed or made, respectively. If the person(s) or organization(s) owned less than 100 percent of the subject matter which would otherwise be prior art to the claimed invention, or less than 100 percent of the claimed invention, then common ownership would not exist"]}, {"tag": "COMBINATION", "patterns": ["COMBINATION"], "responses": ["Section 806.05 in the MPEP - Criteria of Distinctness Between Combination and Subcombination:\n        To support a requirement for restriction between combination and subcombination inventions, both two-way distinctness and reasons for insisting on restriction are necessary, i.e., there would be a serious search burden if restriction were not required as evidenced by separate classification, status, or field of search. See MPEP Â§ 808.02.\n        The inventions are distinct if it can be shown that a combination as claimed:\n            (A) does not require the particulars of the subcombination as claimed for patentability (to show novelty and unobviousness), and\n            (B) the subcombination can be shown to have utility either by itself or in another materially different combination.\n        When these factors cannot be shown, such inventions are not distinct."]}, {"tag": "WIPO", "patterns": ["WIPO", "KIND"], "responses": ["Section 901.04(a) in the MPEP - Kind Codes:\n        On January 2, 2001, the United States Patent and Trademark Office (USPTO) began printing the World Intellectual Property Organization (WIPO) Standard ST.16 code on each of its published patent documents. WIPO Standard ST.16 codes (kind codes) include a letter, and in many cases a number, used to distinguish the kind of patent document (e.g., publication of an application for a utility patent (patent application publication), utility patent, plant patent application publication, plant patent, or design patent) and the level of publication (e.g., first publication, second publication, or corrected publication). Detailed information on Standard ST.16 and the use of kind codes by patent offices throughout the world is available on the WIPO website at www.wipo.int/scit/en  under the links for WIPO standards and other documentation"]}, {"tag": "FOREIGN", "patterns": ["FOREIGN", "INTERNATIONAL"], "responses": ["Section 901.05 in the MPEP - Foreign Patent Documents:\n        All foreign patents, published applications, and any other published derivative material containing portions or summaries of the contents of published or unpublished patents (e.g., abstracts) which have been disseminated to the public are available to U.S. examiners. See MPEP Â§ 901.06(a), paragraphs I.C. and IV.C. \n\n        In general, a foreign patent, the contents of its application, or segments of its content should not be cited as a reference until its date of patenting or its public availability date (e.g., publication date) can be confirmed by an examinerâ\u0080\u0099s review of a copy of the document. Examiners should remember that in some countries, there is a delay between the date of the patent grant and the date of publication.\n        \n        Additional information can be obtained from the Scientific and Technical Information Center (STIC)"]}, {"tag": "ADMINISTRATIVE", "patterns": ["ADMINISTRATIVE", "ADMINISTRATION"], "responses": ["Section 901.05(d) in the MPEP - Foreign Patent Documents:\n        Patent law administration varies from country to country. In some countries, all that is undertaken is an inspection of the papers to determine if they are in proper form. Other countries perform an examination of the merits on the basis of an extensive search of the prior art, as is done in the U.S. The former are referred to as nonexamining or registration countries, although some systems allow for a rejection on matters apparent on the face of the papers, such as matters of form or statutory subject matter."]}, {"tag": "OPPOSITION", "patterns": ["OPPOSITION", "INTER PARTES"], "responses": ["Section 901.05(e) in the MPEP - Oposition:\n        Some examining countries consider participation by the public an inherent feature of their examining system. When an application is found to be allowable by the examiner, it is \"published\" for opposition. Then there is a period, usually 3 or 4 months, within which members of the public can oppose the grant of the patent. In some countries, the opposing party can be any person or company. In other countries, only those parties who are affected by the outcome can participate in the opposition. The opposition is an inter partes proceeding and the opposing party can ordinarily raise any ground on the basis of which a patent would be refused or held invalid, including any applicable referencesmatter."]}, {"tag": "FAMILY", "patterns": ["FAMILY", "CORRESPOND"], "responses": ["Section 901.05(g) in the MPEP - CORRESPONDING SPECIFICATIONS IN A FAMILY OF PATENTS:\n        Since a separate patent must be obtained in each country in which patent rights are desired there may be a large number of patents issued in different countries for the same invention. This group of patents is referred to as a family of patents.\n\n        All of the countries listed in paragraph V of Section 901.05 are parties to the Paris Convention for the Protection of Industrial Property and provide for the right of priority. If an application is filed in one of these countries, an application for the same invention thereafter filed in another country, within 1 year of the filing of the first application, will be entitled to the benefit of the filing date of the first application on fulfilling various conditions. See MPEP Â§ 213. The patents or published specifications of the countries of later filing are required to specify that priority has been claimed and to give the country, date, and number of the priority application. This data serves the purpose, among others, of enabling any patent based on the priority application to be easily located"]}, {"tag": "INID", "patterns": ["INID", "BIBLIO"], "responses": ["Section 901.05(b) in the MPEP - Other Significant Data:\n        The purpose of INID Codes (\"INID\" is an acronym for \"Internationally agreed Numbers for the Identification of (bibliographic) Data\") is to provide a means whereby the various data appearing on the first page of patent and like documents or in patent gazettes can be identified without knowledge of the language used and the laws applied. They are now used by most patent offices and have been applied to U.S. patents since August 4, 1970. Some of the codes are not pertinent to the documents of a particular country and some which are pertinent may, in fact, not be used. INID codes for industrial designs are similar to, but not identical to, those used for patents and like documents. INID codes for industrial designs are provided separately in the remainder of this section.\n\n        INID codes for industrial designs are similar to, but not identical to, those used for patents and like documents. INID codes for industrial designs may be of most interest to design patent examiners."]}, {"tag": "COPY", "patterns": ["COPY", "COPIES"], "responses": ["Section 901.05(c) in the MPEP - Obtaining Copies:\n        Until October 1, 1995, the U.S. Patent and Trademark Office (Office) received copies of the published specifications of patents and patent applications from nearly all the countries which issue them in printed form. The Office now receives most foreign patents in the form of CD-ROM and other electronic media. The foreign patents so obtained are available to examiners from the USPTOâ\u0080\u0099s automated search tools such as the Examinerâ\u0080\u0099s Automated Search Tool (EAST), the Web-based Examiner's Search Tool (WEST), the Foreign Patent Access System (FPAS), and from the Foreign Patents Service Center in STIC.\n\n        Examiners can request copies of any foreign patent documents by submitting an online request using the Foreign Patent Request Form available through STICâ\u0080\u0099s NPL website on the USPTO intranet. Examiners may also request copies directly from the Foreign Patents Service Center of STIC. If examiners so choose, they can make copies themselves."]}, {"tag": "TRANSLATION", "patterns": ["TRANSLATION", "TRANSLATE"], "responses": ["Section 901.05(d) in the MPEP - Translation:\n        Examiners may consult the translators in the Translations Service Center of the Scientific and Technical Information Center (STIC) for oral assistance in translating foreign patents or literature that are possible references for an application being examined. Examiners may also request human (written) translations of pertinent portions of references being considered for citation or already cited in applications\n\n        Examiners may request human (written) translations at any point in the examination process, at the discretion of the individual examiner, but are encouraged to use oral assistance, language reference resources, and machine translations where possible in the early phases of examination. See MPEP Â§ 706.02. Examiners can request human (written) translations, or machine translations, by submitting an online request using the Translations Request Form available through STICâ\u0080\u0099s NPL website on the USPTO intranet."]}, {"tag": "STIC", "patterns": ["STIC", "INFORMATION CENTER", "LIBRARY", "COLLECTION"], "responses": ["Section 901.06(a) in the MPEP - Scientific and Technical Information Center (STIC):\n        The main Scientific and Technical Information Center (STIC) is located at the Remsen Building, Room 1D58, 400 Dulany Street, Alexandria, VA 22314. STIC maintains Electronic Information Centers (EICs) in each Technology Center (TC) whose mission is to assist patent examiners in the patent process by providing fast, accurate, prior art searches, document deliver services, the provision of foreign patent copies, translations of foreign documents, and access to non-patent literature in electronic format and in print.\n\n        Technical literature, foreign patent documents, and reference and online search services available in STIC are all important resources for the patent examiner to utilize. These resources provide material which must be known or searched to determine whether claims of applications are directly anticipated and, therefore, unpatentable under the provisions of 35 U.S.C. 102. STIC handbooks, textbooks, periodicals, reports, and other materials assist examiners in deciding the question of patentable invention in cases in which the primary search indicates that there is some novelty as compared to any single reference in the art"]}, {"tag": "BOOKS", "patterns": ["BOOKS"], "responses": ["Based on recommendations by patent examiners and subject area experts, STIC reviews, selects and purchases primarily English-language publications in all fields of applied technology. Collections of e-books, books in print, and trade catalogs are also purchased by STIC for permanent location in specific Technology Centers (TCs). For instance, the Design Patent Art Units have a great many manufacturersâ\u0080\u0099 catalogs. Books in print, and e-books may be ordered by examiners by contacting the STIC EIC in each TC. A request for a publication can be submitted by using the NPL Purchase Request Form which is available on the STIC NPL website."]}, {"tag": "CLASS", "patterns": ["CLASS", "CLASSIFICATION"], "responses": ["Section 903.04 of the MPEP - Classifying Applications for Publication:\n        Patent application publications are given a primary classification (equivalent to an original classification), and may also be given a secondary classification (equivalent to a cross reference). While there may be only one primary classification for a single patent application publication, there may be any number of secondary classifications. The selection of a primary classification of a patent application publication is based on the applicationâ\u0080\u0099s main inventive concept using the claims as a guide. A primary classification could be any U.S. class/subclass (except cross reference art collections, digests and foreign art collection subclasses). A secondary classification is based on other inventive concepts (mandatory) or valuable disclosure (discretionary), and may be any U.S. class/subclass (including cross reference collections and digests, but excluding foreign art collection subclasses). The classification of a patent application publication is printed on the front page of the publication.\n\n        At least 9 weeks prior to the projected publication date, applications are classified using programs designed to enable entry of certain data required for publication of patent applications. Applications are classified by giving each application at least a primary classification and an international classification. The suggested international classification(s) corresponding to each assigned U.S. classification is provided. In addition, if a figure is to be published, the figure is selected at the time of classification."]}, {"tag": "CLASSIFICATION_SYSTEMS", "patterns": ["CLASSIFICATION SYSTEMS", "CLASSIFICATION"], "responses": ["Section 902 of the MPEP - Search Tools and Classification Information:\n        There are multiple classification systems used throughout the international patent system. These include the Cooperative Patent Classification System (CPC), U.S. Patent Classification System (USPC), the International Patent Classification System (IPC), and the Locarno International Classification (Locarno). All U.S. patents and U.S. Patent Application Publications published after December 31, 2014 will no longer receive classifications within the USPC. The USPC will, at that time, become a static searchable database.\n\n        In using any classification system, it is necessary to analyze the organization of the class or classes to be included in the search.\n        The initial analysis should determine which one or ones of the several types of subject matter (manufacture, art, apparatus, or stock material) are contained in the class being considered."]}, {"tag": "DEFINITION", "patterns": ["DEFINITION", "DEFINITIONS"], "responses": ["Section 902.02  of the MPEP - Search Tools and Classification Information:\n        All of the utility classes (i.e., classes devoted to technology), and the plant class have definitions. All design classes will eventually have definitions.\n        Definitions state the subject matter of the classes and subclasses in much more detail than it is possible to state in the brief class and subclass titles. A study of the definitions is essential to determine the proper classification of subject matter within the U.S. Patent Classification System (USPC).\n        All classes and subclasses (class definitions) in the USPC are available online to USPTO personnel from the Classification Home Page under the heading Search Classification Data. The Classification Home Page (http://ptoweb:8081/ ) is accessible from the desktop via the Patent Examinerâ\u0080\u0099s Toolkit. The class definitions are archived in portable document formats (PDFs) to CD-ROM every June and December.\n        It should be noted that classification orders frequently affect existing definitions. Personal sets of definitions used by examiners should be periodically revised to reflect these changes. Classification Orders are available online to USPTO personnel from the Classification Home Page under the heading Classification Reports. The Classification Home Page is accessible from the desktop via the Patent Examinerâ\u0080\u0099s Toolkit."]}, {"tag": "EAST", "patterns": ["EAST", "WEST"], "responses": ["The automated search tools on examinersâ\u0080\u0099 desktop computers include the Examinerâ\u0080\u0099s Automated Search Tool (EAST), the Web-Based Examiner Search Tool (WEST), and the Foreign Patent Access System (FPAS). EAST and WEST provide examiners with access to the: (A) full text of U.S. published applications since 2001; (B) full text of U.S. patents granted since 1970; and (C) optically scanned full text of U.S. patents granted 1920-1970.Specific instructions for gaining access to the various documents available using the automated search tools can be found in the \"Patent Automation\" folder in Microsoft Outlook and on the EAST, WEST, and BRS Search Strategy webpages on the Intranet, available on the examinersâ\u0080\u0099 desktop computers."]}, {"tag": "CLASSIFICATION", "patterns": ["CLASSIFICATION", "CLASS", "CLASSIFICATION", "SEARCH"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e110007.html\">PRIOR ART, CLASSIFICATION, AND SEARCH</a>"]}, {"tag": "CLASSIFICATION_ALLOWANCE", "patterns": ["CLASSIFICATION ALLOWANCE", "CLASSIFICATION AT ALLOWANCE", "CLASSIFICATION AT ACCEPTANCE", "ALLOWANCE CLASSIFICATION", "ACCEPTANCE CLASSIFICATION"], "responses": ["Section 903.07 of the MPEP - Classifying and Cross-Referencing at Allowance:\n        An application, properly classified at the start of examination, may be classified differently when it is ready for allowance. The allowed claims should be reviewed in order to determine the subject matter covered thereby. It is the disclosed subject matter covered by the allowed claims that determines the original and any mandatory cross-reference classification of U.S. patents.\n\n        The procedure for determining the classification of an issuing application is as follows: every claim, whether independent or dependent, must be considered separately for classification. A separate mandatory classification is required for each claim which is classifiable in a different class or subclass; some claims, particularly in chemical areas, may require plural classifications. After all mandatory classifications have been determined, the classification to be designated as the original (OR) is determined."]}, {"tag": "CROSS-REFERENCE", "patterns": ["CROSS-REFERENCE", "CROSS REFERENCE", "CROSS REFERENCING", "CROSS-REFERENCING"], "responses": ["Section 903.07(a) of the MPEP - Cross-Referencing â\u0080\u0094 Keep Systematic Notes During Prosecution:\n        Throughout the examination of an application, systematic notes should be kept as to cross-references needed either due to claimed or unclaimed disclosure. Examiners handling related subject matter should be consulted during prosecution (whether they handle larger unclaimed combinations or claimed or unclaimed, but disclosed, subcombinations), and asked if cross-references are needed.\n\n        Each consultation involving a question of the propriety of the classification of subject matter and/or the need for a cross-reference must be recorded in the SEARCH NOTES box on the file wrapper and must include: the name of each examiner consulted, the date that the consultation took place, and the results of the consultation including the consulted examinersâ\u0080\u0099 or examinerâ\u0080\u0099s indication of where claimed subject matter is properly classified and where subject matter disclosed but unclaimed is properly classified and whether or not a cross-reference is needed.mined."]}, {"tag": "ASSIGNMENT", "patterns": ["ASSIGNMENT"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e17683.html\">OWNERSHIP AND ASSIGNMENT</a>"]}, {"tag": "TRANSFER", "patterns": ["TRANSFER"], "responses": ["Section 903.08(d) of the MPEP - Transfer Procedure:\n        I.   TRANSFER BETWEEN ART UNITS WITHIN THE SAME TECHNOLOGY CENTER\n            Each Technology Center (TC) has developed internal procedures for transferring application between art units and resolving application assignment disputes.\n\n        II.   TRANSFERS BETWEEN DIFFERENT TECHNOLOGY CENTERS\n            Where a supervisory patent examiner (SPE) believes an application, either new or amended, does not belong in his or her art unit, he or she may request transfer of the application from his or her art unit (the \"originating\" art unit) to another art unit of a different TC (the \"receiving\" art unit).\n            The decision as to the classification resolution and assignment of an application is made by agreement between the SPEs involved in the transfer. If no agreement can be reached between the SPEs, the application may be forwarded to the classification dispute TC representative panel of the TC where the application was originally assigned for a final decision. The classification dispute TC representative panel consists of designated representatives from each TCupervisory patent examiner is given the responsibility of assigning applications, time so spent may, at the TC Directorâ\u0080\u0099s discretion, be charged to \"Assisting SPE.\""]}, {"tag": "TRANSFER_PROCESS", "patterns": ["TRANSFER PROCESS", "PROCESS FOR TRANSFER"], "responses": ["Section 903.08(d) of the MPEP - Transfer Procedure:\n        When the SPE or primary examiner of the originating art unit determines that a transfer is appropriate, he or she must complete the Application Transfer Request form in Patent File Wrapper (PFW) and provide a full explanation of the reasons for classification in the receiving art unit. At least one of the following should be included in the form in the space provided:\n            (A) Identification of the controlling claim;\n            (B) Identification of any existing informal transfer agreement; or\n            (C) Other reasons â\u0080\u0093 with full explanation.\n        If the SPE or examiner of the originating art unit believes an application has been improperly assigned to their art unit, but is unable to determine an appropriate place to send the application, a \"gatekeeper\" or search assistant should be consulted. A listing of examiners who function in this role may be found at http://ptoweb/patents/tsa/. It is noted that \"gatekeepers\" or search assistants exist in all of the TCs except the TC that examines design applications (TC 2900).on was originally assigned for a final decision. The classification dispute TC representative panel consists of designated representatives from each TCupervisory patent examiner is given the responsibility of assigning applications, time so spent may, at the TC Directorâ\u0080\u0099s discretion, be charged to \"Assisting SPE.\""]}, {"tag": "SEARCH", "patterns": ["SEARCH", "SEARCHING"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e110007.html\">PRIOR ART, CLASSIFICATION, AND SEARCH</a>"]}, {"tag": "INTERNET", "patterns": ["INTERNET"], "responses": ["Section 904.02(c) of the MPEP - Internet Searching:\n        The Internet is an Office-approved search tool that may be considered when planning and conducting a search for an application. The Internet provides the Office the opportunity to enhance operations by enabling patent examiners to efficiently locate and retrieve additional sources of information relating to a patent application. \n\n        The Internet is generally a public forum and most communications made over the Internet are neither confidential nor secure. All use of the Internet by examiners must be conducted in a manner that ensures compliance with confidentiality requirements in the statutes, including 35 U.S.C. Â§ 122, and regulations. Additionally, any Internet searching that is conducted is to be limited to searching for the information necessary for examination of the application or proceeding, such as the state of the art or the presence or absence of technical features in the prior art."]}, {"tag": "CPC", "patterns": ["CPC", "COOPERATIVE PATENT CLASSIFICATION"], "responses": ["Section 905 of the MPEP - How to Cooperative Patent Classification:\n        Cooperative Patent Classification (CPC) is a bilateral classification system jointly developed by the United States Patent and Trademark Office (USPTO) and the European Patent Office (EPO). CPC is jointly managed and maintained by both offices and is available for public search for classification.\n\n        The CPC classification system arranges subject matter into hierarchical arrays.\n            (A) The highest array or level is the Section.\n            (B) Each section is subdivided into Classes.\n            (C) Each class is subdivided into one or more subclasses.\n            (D) Each subclass is broken down into Groups (main groups and subgroups)."]}, {"tag": "INTERNATIONAL_CLASSIFICATION", "patterns": ["INTERNATIONAL CLASSIFICATION", "INT. Cl."], "responses": ["Section 906 of the MPEP - International Classification of Patents for Inventions\n        In accordance with the Strasbourg Agreement Concerning the International Patent Classification, the United States is required to indicate on its issuing documents the classification symbols of the International Patent Classification 2006 (Eighth Edition), hereinafter referred to as \"Int. Cl.\"\n        The complete Int. Cl. symbols must be placed in the indicated space on the Image File Wrapper (IFW) issue classification form when an application is issued."]}, {"tag": "LOCARNO", "patterns": ["LOCARNO"], "responses": ["Section 907 of the MPEP - Locarno Classification Designations\n        U.S. design patents prepared for issue after June 30, 1996 and international design applications include a Locarno International Classification designation as part of the bibliographic data. The purpose of the international design classification designation is to enhance accessibility of design patents in foreign design search files as well as commercial databases.\n\n        A Locarno International Classification designation consists of two pairs of numbers separated by a hyphen. The first pair of numbers designates a design class; the second pair of numbers indicates a particular subclass within the design class. The Locarno Classification manual, available from WIPO, delineates the individual classes and subclasses and includes: (1) a general list of classes of industrial designs divided into broad subclasses; and (2) an alphabetical list of specific industrial designs with an indication of the classes and subclasses into which they should be classified."]}, {"tag": "DIRECTOR", "patterns": ["DIRECTOR"], "responses": ["Section 1001.01 of the MPEP - Modes of Exercising Authority:\n        The authority of the Director of the USPTO to review and supervise the work of the Office is exercised by the promulgation of the Rules of Practice; issuance of orders, notices and memoranda stating Office policies and modes for effectuating these policies; decisions on petitions by applicants; and by the designation of particular cases which must be submitted to the Director of the USPTO or other officials authorized by the Director of the USPTO."]}, {"tag": "PETITION", "patterns": ["PETITION"], "responses": ["Section 1002 of the MPEP - Petitions to the Director of the USPTO:\n        (a) Petition may be taken to the Director:\n            (1) From any action or requirement of any examiner in the ex parte prosecution of an application, or in ex parte or inter partes prosecution of a reexamination proceeding which is not subject to appeal to the Patent Trial and Appeal Board or to the court;\n            (2) In cases in which a statute or the rules specify that the matter is to be determined directly by or reviewed by the Director; and\n            (3) To invoke the supervisory authority of the Director in appropriate circumstances. For petitions involving action of the Patent Trial and Appeal Board, see Â§ 41.3 of this title.\n        A petition should include:\n            1. A statement of the type of relief requested and the authorizing provision of statute or rules, if applicable;\n            2. A statement of the relevant facts;\n            3. An identification of the points that are to be reviewed; and\n            4. The fee, where required."]}, {"tag": "AUTHORITY", "patterns": ["AUTHORITY", "DELEGATION"], "responses": ["Section 1002.02 of the MPEP - Delegation of Authority To Decide Petitions:\n        Petitions to the Director of the USPTO are decided in accordance with the delegation of authority in section 1002.02. The delegation of specific petitions and/or matters to the Technology Center (TC) Directors is identified in the sections that follow. Unless specifically provided for in the letter of delegation of authority, further delegations are not permitted. Any petitions and/or matters so delegated by the TC Directors may be decided by the TC Directors.\n\n        Authority not herein delegated has been reserved to the Director of the USPTO and may be delegated to appropriate officials on an ad hoc basis."]}, {"tag": "DEPUTY", "patterns": ["DEPUTY"], "responses": ["Section 1002.02(b) of the MPEP - Petitions and Requests Decided by the Office of the Deputy Commissioner for Patent Examination Policy:\n        All petitions decided by the Office of the Deputy Commissioner for Patent Examination Policy should be directed to \"Mail Stop Petition, Commissioner for Patents, P.O. Box 1450, Alexandria, Virginia 22313-1450,\" except as otherwise provided. For example, applications for patent term extension under 35 U.S.C. 156  should be directed to Mail Stop Hatch-Waxman PTE and petitions for retroactive foreign filing license under 37 CFR 5.25  should be directed to Mail Stop L and R."]}, {"tag": "TECHNOLOGY_CENTER_DIRECTOR", "patterns": ["TECHNOLOGY CENTER DIRECTOR", "TECH CENTER DIRECTOR"], "responses": ["Section 1002.02(c) of the MPEP - Petitions and Requests Decided by the Technology Center Directors\n        Section 1003 of the MPEP - Matters Submitted to Technology Center Directors"]}, {"tag": "3640", "patterns": ["3640"], "responses": ["1002.02(c)(1) of the MPEP - Petitions Decided by the Director of Technology Center 3640"]}, {"tag": "1600", "patterns": ["1600"], "responses": ["1002.02(c)(2) of the MPEP - Petitions Decided by the Director of Technology Center 1600"]}, {"tag": "2900", "patterns": ["2900"], "responses": ["1002.02(c)(3) of the MPEP - Petitions and Requests Decided by the Director of Technology Center 2900"]}, {"tag": "REEXAMINATION", "patterns": ["REEXAMINATION"], "responses": ["1002.02(c)(4) of the MPEP - Petitions Decided by the Director of the Central Reexamination Unit"]}, {"tag": "SUPERVISORY", "patterns": ["SUPERVISORY", "SUPERVISOR"], "responses": ["1002.02(d) of the MPEP - Petitions and Matters Decided by Supervisory Patent Examiners"]}, {"tag": "CHIEF", "patterns": ["CHIEF", "CHIEF PATENT JUDGE", "CHIEF JUDGE"], "responses": ["1002.02(f) of the MPEP - Petitions and Matters Decided by the Chief Administrative Patent Judge of the Patent Trial and Appeal Boardrs"]}, {"tag": "PATENT_JUDGE", "patterns": ["PATENT JUDGE", "PATENT JUDGE"], "responses": ["1002.02(g) of the MPEPE - Petitions Decided by the Administrative Patent Judges"]}, {"tag": "APPEAL_BOARD", "patterns": ["APPEAL BOARD", "PATENT TRIAL BOARD"], "responses": ["1002.02(j) of the MPEP - Petitions Decided by the Patent Trial and Appeal Board"]}, {"tag": "GENERAL_COUNSEL", "patterns": ["GENERAL COUNSEL"], "responses": ["1002.02(k)(1) of the MPEP - Petitions and Matters Decided by the General Counsel"]}, {"tag": "SOLICITOR", "patterns": ["SOLICITOR"], "responses": ["1002.02(k)(3) of the MPEP - Petitions and Matters Decided by the Solicitor"]}, {"tag": "DISCIPLINE", "patterns": ["DISCIPLINE", "ENROLLMENT"], "responses": ["1002.02(m) of the MPEP - Petitions Decided by the Director of the Office of Enrollment and Discipline"]}, {"tag": "PRIMARY_EXAMINER", "patterns": ["PRIMARY EXAMINER"], "responses": ["Section 1004 of the MPEP - Actions Which Require the Attention of a Primary Examiner"]}, {"tag": "SIGNATORY", "patterns": ["SIGNATORY"], "responses": ["Section 1005 of the MPEP - Exceptions to Partial Signatory Authority"]}, {"tag": "INTELLECTUAL_PROPERTY", "patterns": ["INTELLECTUAL PROPERTY"], "responses": ["Intellectual property (IP) refers to creations of the mind, such as inventions; literary and artistic works; designs; and symbols, names and images used in commerce."]}, {"tag": "INTELLECTUAL_PROPERTY_TYPE", "patterns": ["INTELLECTUAL PROPERTY TYPE"], "responses": ["There are four forms of Intellectual Properties: Copyrights, Trade Secrets, Trademark, and Patents."]}, {"tag": "COPYRIGHT", "patterns": ["COPYRIGHT"], "responses": ["Protect original works of authorship such as writings, music, and works of art (The Library of Congress registers U.S. copyrights, which last for the life of the author plus 70 years, for works created after 1/1/78.)"]}, {"tag": "TRADE_SECRET", "patterns": ["TRADE SECRET"], "responses": ["Information that companies keep secret to give them an advantage over their competitors (can be discovered through reverse engineering, or can last forever if kept secret)"]}, {"tag": "TRADEMARK", "patterns": ["TRADEMARK"], "responses": ["Protects words, names, symbols, sounds, or colors that distinguish goods and services from those manufactured or sold by others and to indicate the source of the goods (can be renewed forever as long as they are being used in commerce)"]}, {"tag": "TRADEMARK_NAME", "patterns": ["TRADEMARK NAME"], "responses": ["A nonproprietary name by which an article or product is known and called among traders or workers in the art, although it may not be so known by the public, generally. Names used in trade do not point to the product of one producer, but they identify a single article or product irrespective of producer."]}, {"tag": "PATENT", "patterns": ["PATENT"], "responses": ["A property right granted by the government of a country to exclude others from making, using, selling, offering for sale, or importing the invention, for a limited time in exchange for public disclosure of the invention when the patent is granted.\n            - \"Applicant\" can include inventor(s), assignee(s), or an entity who shows a sufficient proprietary interest.\n            - Patent document describes how to make and use invention.\n            - Includes at least one \"claim\" setting forth the protected invention"]}, {"tag": "PATENT_OVER_TRADE_SECRET", "patterns": ["PATENT OVER TRADE SECRET"], "responses": ["Quid Pro Quo\n        - In exchange for providing new knowledge/information to the public, the owner of the patent is granted an exclusive right to make, use, offer for sale, sell, or import into the U.S. the inventions covered by the patent claims\n        - Enables potential financial gain to the inventor(s) and patent owner(s), as well as any licensees\n        Public Gain\n        - Public has the ability to make, use, sell, and import the claimed invention after patent term expiration, unleashing free market competitive forces\n        - Promotes progress and development of new technologies"]}, {"tag": "PATENT_TYPE", "patterns": ["PATENT TYPE"], "responses": ["Utility - any new and useful process, article of manufacture, machine, or composition, or improvement thereof\n        Design - a new original, and ornamental design for an article of manufacture\n        Plant - any distinct and new variety of plant that is invented or discovered and asexually produced"]}, {"tag": "DESIGN_PATENT", "patterns": ["DESIGN PATENT"], "responses": ["Design patents granted to anyone who invents a new, original, and ornamental design. Only protects the appearance of an article. Only one claim permitted that refers to drawing(s).\n        Term lasts 15 years from date of patent grant if filed on or after May 13, 2015. Term lasts 14 years from date of patent grant if filed on or before May 12, 2015. No fees necessary to maintain a design patent in force\n\n        Refer to this guide for more details: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e150114.html\">Design Patents</a>"]}, {"tag": "PLANT_PATENT", "patterns": ["PLANT PATENT"], "responses": ["Granted to anyone who invents or discovers AND asexually reproduces any distinct and new variety of plant. Must be produced by means other than seeds. Only one claim permitted.\n        Drawings are for artistic, rather than mechanical, purposes, in order to disclose all the distinctive characteristics of the plant capable of visual representation. Plant patent term - 20 years from filing date.\n\n        Refer to this guide for more details: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e161282.html\">Plant Patents</a>"]}, {"tag": "UTILITY_PATENT", "patterns": ["UTILITY PATENT"], "responses": ["Utility patent applications cover inventions, discoveries or improvements of:\n        - Any new and useful process. Example: method of recording video\n        - Machine. Example: video camera\n        - Article of manufacture. Example: case for a video camera\n        - Composition of matter. Example: material comprising a new type of camera lens\n        Patent term lasts 20 years from the effective filing date (for applications filed on or after June 8, 1995). Maintenance fee required to keep patent in force. Application requirements differ for provisional and nonprovisional applications (next section)."]}, {"tag": "APPLY_FOR_PATENT", "patterns": ["APPLY FOR PATENT"], "responses": ["Anyone, from anywhere, may apply, with exception of officers and employees of the Patent and Trademark Office, during the period of their appointments and for one year thereafter"]}, {"tag": "PATENT_PARTS", "patterns": ["PATENT PARTS"], "responses": ["Each patent must have the following parts:\n        - Title\n        - Abstract\n        - Drawings or pictures if necessary to describe the invention\n        - A specification, including a description of the invention, and\n        - At least one claim.\n        Other requirements vary by type of patent, and subject matter."]}, {"tag": "USPTO_MISSION", "patterns": ["USPTO MISSION"], "responses": ["Fostering innovation, competitiveness and economic growth, domestically and abroad by delivering high quality and timely examination of patent and trademark applications, guiding domestic and international intellectual property (IP) policy, and delivering IP information and education worldwide, with a highly skilled, diverse workforce"]}, {"tag": "USPTO_VISION", "patterns": ["USPTO VISION"], "responses": ["Leading the nation and the world in IP protection and policy"]}, {"tag": "AMERICA_INVENTS_ACT", "patterns": ["AMERICA INVENTS ACT", "AIA", "LEAHYâ\u0080\u0093SMITH"], "responses": ["The America Invents Act was enacted into law on September 16, 2011\n        - Effective September 16, 2012:\n            o Inventor's oath or declaration not required at filing, but an application data sheet (ADS) is required\n            o Third party prior art submissions may be submitted in another's patent application\n        - Effective March 16, 2013:\n            o Changed from \"first to invent\" to \"first inventor to file\""]}, {"tag": "COURT_OF_APPEALS_FEDERAL_CIRCUIT", "patterns": ["COURT OF APPEALS FEDERAL CIRCUIT"], "responses": ["Created in 1982 to provide for a single circuit court with jurisdiction over patent appeals from district courts and USPTO\n        - Before 1982, regional circuit courts heard patent appeals from district courts. the Court of Customs and Patent Appeals (CCPA) heard appeals from USPTO's Board of Patent Appeals and Interferences (now the Patent Trial and Appeal Board)\n        - The CAFC also hears appeals from other courts and boards, including Court of Federal Claims, Court of Veterans Appeals, Merit Systems Protection Board (MSPB), etc.\n        - A complete listing of recent opinions and orders is at <a target=\"_new\" href=\"http://www.cafc.uscourts.gov/opinions-orders\">here</a>"]}, {"tag": "PATENT_APPEAL", "patterns": ["PATENT APPEAL"], "responses": ["Patent appeals are heard by the Court of Appeals for the Federal Circuit before being heard of the U.S. Supreme Court, at its discretion. State courts have no jurisdiction regarding patent law. The lowest level court to hear a patent case is a district court."]}, {"tag": "ALLOWED", "patterns": ["ALLOWED"], "responses": ["Patent application which has been indicated by an examiner as meeting all statutory (laws) and regulatory (rules) requirements â\u0080\u0093not patented yet; may or may not have been published"]}, {"tag": "PATENTED", "patterns": ["PATENTED"], "responses": ["Allowed patent application which has been issued (published) on the patent (issue) date"]}, {"tag": "ABANDONED", "patterns": ["ABANDONED"], "responses": ["Application which is no longer pending and was not patented; may be expressly requested by applicant or be as a result of failing to respond within a set time period"]}, {"tag": "101", "patterns": ["101"], "responses": ["It is type of rejection based on whether or not the claimed subject matter is subject matter eligible\n        35 U.S.C. $101\n        \"Whoever invents or discovers any new and useful process, machine, manufacture, composition of matter, or any new and useful improvement thereof, may obtain a patent therefor,...\""]}, {"tag": "101_SIGNIFICANTLY_MORE", "patterns": ["101 SIGNIFICANTLY MORE"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://rdms-mpep-vip.uspto.gov/RDMS/MPEP/current#/result/d0e197244.html?q=significantly%20more&ccb=on&ncb=off&icb=off&fcb=off&ver=current&syn=adj&results=compact&sort=relevance&cnt=10&index=1\">Reference</a>"]}, {"tag": "102", "patterns": ["102"], "responses": ["It is type of rejection based on whether or not the claimed subject matter is novel."]}, {"tag": "102A1", "patterns": ["102A1"], "responses": ["$ 102. Conditions for patentability; novelty (a) NOVELTY; PRIOR ARTâ\u0080\u0094 a person shall be entitled to a patent unlessâ\u0080\u0094 (1) the claimed invention was patented, described in a printed publication, or in public use, on sale, or otherwise available to the public before the effective filing date of the claimed invention. An essential part of the overall patent examination process is to determine whether those conditions are met for claims in an application. This determination is made after a complete search for the claimed invention is done. Conditions met: the claims lack \"novelty\"(unless an exception applies) and are therefore unpatentable (Result: Reject claims under 35 U.S.C. $102(a)(1)). Conditions not met: no rejection is made under 35 U.S.C. $102(a)(1) (Patent is not necessarily issued because rejections under other statutes may still apply 35 U.S.C. $101, 35 U.S.C. $102(a)(2), 35 U.S.C. $103, 35 U.S.C. $112)"]}, {"tag": "102A2", "patterns": ["102A2"], "responses": ["$ 102. Conditions for patentability; novelty (a) NOVELTY; PRIOR ART.â\u0080\u0094A person shall be entitled to a patent unlessâ\u0080\u0094 . . . . (2) the claimed invention was described in a patent issued under section 151, or in an application for patent published or deemed published under section 122(b), in which the patent or application, as the case may be, names another inventor and was effectively filed before the effective filing date of the claimed invention."]}, {"tag": "IN_PUBLIC_USE", "patterns": ["IN PUBLIC USE"], "responses": ["Any \"use\" or \"on sale\" must be \"public\". This is different from pre-AIA law where \"sales\" did not have to be \"public\". The \"use\" or \"on sale\" does not have to enable someone to make and use the invention under 35 U.S.C. $112(a). The \"use\" or \"on sale\" can occur anywhere, i.e., they can occur outside the United States. This is different from pre-AIA law where the \"use\" or \"on sale\" could only be in the United States. Relevant date for public use or on sale activity being used as prior art under 102(a)(1) - the date the actual \"use\" or \"on sale\" activity took place."]}, {"tag": "OTHERWISE_AVAILABLE_TO_THE_PUBLIC", "patterns": ["OTHERWISE AVAILABLE TO THE PUBLIC"], "responses": ["\"Otherwise available to the public\" is a catch-all provision of $102(a)(1) that has no counterpart in pre-AIA law. Examples: an oral presentation at a scientific meeting, a demonstration at a trade show, a lecture or speech, a statement made on a radio talk show, a YouTube video, Web site, or other on-line material (may also qualify as a \"printed publication\"). Relevant Date for otherwise available to the public disclosure being used as prior art under 102(a)(1). The date the actual disclosure took place."]}, {"tag": "REFERENCE", "patterns": ["REFERENCE"], "responses": ["- Any patent (U.S., Foreign)\n        - Any printed publication\n        - Any document or other evidence that can be used to establish an act of public use, on sale, or public availability"]}, {"tag": "PRIOR_ART", "patterns": ["PRIOR ART"], "responses": ["The term \"prior art\" is usually qualified with a section of 35 U.S.C. $102 (\"Prior art under 35 U.S.C. $102(a)(1)\" and \"Prior art under 35 U.S.C. $102(a)(2)\"). Prior art under 35 U.S.C. $102(a)(1) is any \"disclosure\", as defined previously relative to 35 U.S.C. $102(a)(1), that meets the timing requirements for 35 U.S.C. $102(a)(1) and for which no exception applies\n        The most common type of prior art is a reference document, such as:\n        - Patents (foreign and domestic)\n        - Patent application publications (international, foreign, and domestic)\n        - Non-patent literature (NPL), e.g., books, journal articles, web-based publications, etc.\n        Another type of prior art is applicant admitted prior art (AAPA)"]}, {"tag": "103", "patterns": ["103"], "responses": ["It is type of rejection based on whether or not the claimed subject matter is obvious. A patent may not be obtained though the invention is not identically disclosed or described as set forth in section 102 of this title, if the differences between the subject matter sought to be patented and the prior art are such that the subject matter as a whole would have been obvious at the time the invention was made to a person having ordinary skill in the art to which said subject matter pertains. Patentability shall not be negatived by the manner in which the invention was made."]}, {"tag": "PRIOR_ART_103", "patterns": ["PRIOR ART 103"], "responses": ["For both pre-AIA and AIA applications\n        - Prior art includes both the specialized understanding of one of ordinary skill in the art and the common understanding of the layman.\n        - Most 35 U.S.C. $103 rejections are made based on prior art available under 35 U.S.C. $102\n        - References that meet the \"who,\" \"when,\" and \"where\" criteria set forth in $102 to qualify as prior art are available as prior art to use in any appropriate rejection under $103\n        In addition to references available under 35 U.S.C. $102, examiners may rely on, for example, official notice, common sense, common ingenuity, and obvious matters of design choice, provided sufficient explanation is set forth to establish a prima facie case of obviousness."]}, {"tag": "CITATION_OF_PRIOR_ART", "patterns": ["CITATION OF PRIOR ART", "EX PARTE REEXAMINATION OF PATENTS"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e220689.html\">Citation of Prior Art</a>"]}, {"tag": "102_REJECTION", "patterns": ["102 REJECTION"], "responses": ["For a particular claim, a rejection based alternatively under 35 USC $102 or 35 USC $103 is permissible under certain limited circumstances, e.g. rejections of product-by-process claims. Reliance on alternative grounds of rejection using 35 USC $102 and 35 USC $103 does not eliminate the need to explain both the anticipation and obviousness aspects of the rejections."]}, {"tag": "OFFICIAL_NOTICE", "patterns": ["OFFICIAL NOTICE"], "responses": ["Official Notice is a tool that enables an Examiner to rely on common knowledge or incorporate facts not otherwise in the record, without documentary evidence (See MPEP 2144.03). In appropriate circumstances, Official Notice can provide facts to \"fill in the gaps\" to address small details that are being claimed and are known to exist in the relevant art, but which are not present in the prior art of record. Official Notice should only be taken by the Examiner where the facts asserted to be well-known, or to be common knowledge in the art, are capable of instant and unquestionable demonstration as being well-known so as to defy dispute. Taking Official Notice should be rare when an application is under final rejection or action. If Official Notice is taken, the basis for such reasoning must be set forth explicitly. The Examiner must provide specific factual findings predicated on sound technical and scientific reasoning to support his or her conclusion of common knowledge. It is never appropriate to rely solely on Official Notice as the principal evidence upon which a rejection was based."]}, {"tag": "112A_FIRST_REQUIREMENT", "patterns": ["112A FIRST REQUIREMENT"], "responses": ["Written Description - To satisfy the written description requirement, the specification must describe the claimed invention in sufficient detail that one skilled in the art can reasonably conclude that the applicant had possession of the claimed invention. Fundamental factual inquiry: whether the specification conveys with reasonable clarity to those skilled in the art that, as of the filing date sought, applicant was in possession of the invention as now claimed (MPEP $$ 2161.01, 2163(I), 2163.02). An original claim may lack written description when the claim defines the invention in functional language specifying a desired result but the specification does not sufficiently identify how the function is performed or result is achieved. For programmed computer functions, determine whether the specification discloses in adequate detail the computer and the algorithm (e.g., the necessary steps and/or flowcharts) that perform the claimed function. It is not enough that one skilled in the art could write a program to achieve the claimed function. Establish a clear prosecution record by setting forth reasons why the application disclosure fails to provide written description support under $ 112(a) and thus the claims that rely thereon are rejected"]}, {"tag": "112A_SECOND_REQUIREMENT", "patterns": ["112A SECOND REQUIREMENT"], "responses": ["Enablement - For enablement, the critical inquiry is: Does the specification provide enough information so that one of ordinary skill in the art can make and/or use the full scope of the claimed invention without \"undue experimentation\"? The specification need not teach what is well-known in the art. However, applicant cannot rely on the knowledge of one skilled in the art to supply information that is required to enable the novel aspects of the claimed invention, when the enabling knowledge is in fact not known in the art. Enablement can be shown by disclosing at least one method for making and using the claimed invention that bears a reasonable correlation to the entire scope of the claim. Failure to disclose other methods by which the claimed invention may be made does not render a claim invalid for lack of enablement (MPEP2161.01(III), 2164, 2164.01(b)). The critical inquiry is whether the specification provides enough information so that one of ordinary skill in the art can make and/or use the full scope of the claimed invention without \"undue experimentation\". Analysis regarding whether a disclosure is enabling must be based on a consideration of all the evidence of record related to the pertinent Wands factors and the evidence as a whole. Enablement issues typically arise with computer-implemented inventions when the scope of the claim is not commensurate with the disclosure, such that the claim would cover all devices for/ways of performing a function. Establish a clear prosecution record by setting forth reasons related to the pertinent Wands factors as to why the application disclosure fails to enable the claim(s) under $ 112(a) and thus the claims that rely thereon are rejected."]}, {"tag": "112A_THIRD_REQUIREMENT", "patterns": ["112A THIRD REQUIREMENT"], "responses": ["Best Mode - The best mode requirement creates a statutory bargained for exchange. Patentee obtains the right to exclude others from practicing the claimed invention for a certain time period. The public receives knowledge of the preferred embodiments for practicing the claimed invention. (Eli Lilly v. Barr Laboratories, 58 USPQ2d 1869, 1874 (Fed. Cir. 2001)). It is the concealment of the best mode of practicing the claimed invention that $ 112(a), is designed to prohibit. A presumption best mode is disclosed exists, unless there is evidence to the contrary (MPEP 2165.03 I). Rejections under best mode are rare and any such rejection should be discussed with your SPE or Primary Examiner."]}, {"tag": "112B", "patterns": ["112B"], "responses": ["(b) CONCLUSION The specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the inventor or a joint inventor regards as the invention.\n\n        It is type of rejection based on whether the claims are sufficiently definite to understand the \"metes and bounds\" of what is being claimed. The specification shall conclude with one or more claims particularly pointing out and distinctly claiming the subject matter which the inventor or a joint inventor regards as the invention. Statutory requirement for the inventor or joint inventor to define precisely what the invention is. Claims define the invention for which protection is granted. 35 U.S.C. $112(b) requires definiteness of claim language. The primary purpose is to ensure that the scope of the claims is clear so that the public is informed of the boundaries of what constitutes infringement. A secondary purpose is to provide a clear measure of what applicants regard as the invention so that you can determine whether the claimed invention meets all of the criteria for patentability and whether the specification meets the criteria of 35 U.S.C. $112(a)with respect to the claimed invention. Ensuring that the boundaries of the claimed invention are clear to one of ordinary skill in the art enhances patent quality and clarity. Establishing a clear written prosecution record of how the claim boundaries were defined prior to issuance depends on both examiners and applicants. Clarifying the record establishes a foundation for claim interpretation throughout prosecution and the life of the patent, which benefits the examiner, the applicant, and the public."]}, {"tag": "112C", "patterns": ["112C"], "responses": ["(c) FORM. A claim may be written in independent or, if the nature of the case admits, in dependent or multiple dependent form."]}, {"tag": "112F", "patterns": ["112F"], "responses": ["\"An element in a claim for a combination may be expressed as a means or step for performing a specified function without the recital of structure, material, or acts in support thereof, and such claim shall be construed to cover the corresponding structure, material, or acts described in the specification and equivalents thereof.\"\n\n        35 U.S.C. $112(f) allows applicants to use functional language in a claim. Commonly called means-plus-function claiming. The claim must be for a combination of elements cannot use 112(f) in a claim reciting only one element (a \"single means claim\"). The claim element must be expressed as a means or step for (or a substitute term for \"means for\" may be used) performing a specified function. The claim element must not recite structure, material or acts that perform the function. The structure, material, or acts that correspond to the recited function must be described in the specification."]}, {"tag": "EQUIVALENT_STRUCTURE", "patterns": ["EQUIVALENT STRUCTURE"], "responses": ["1) Prior art element performs the function specified in the claim in substantially the same way, and produces substantially the same results as the corresponding element disclosed in the specification;\n        2) Whether one skilled in the art would recognize the interchangeability of the element shown in the prior art for the corresponding element disclosed in the specification; or\n        3) Whether there are insubstantial differences between the prior art element and the structure, material or acts disclosed in the specification.\n        Examples above are not intended to be an exhaustive list of indicia, and only one of the above noted factors (or other rationale) need exist to support a finding of equivalence."]}, {"tag": "131", "patterns": ["131"], "responses": ["A Rule 131 affidavit or declaration allows an inventor of a pre-AIA (FTI) application or the owner of a pre-AIA (FTI) patent under reexamination to swear behind (i.e., antedate) a reference or activity which appears to be available as prior art under:\n        Pre-AIA 35 U.S.C. $102(a) and/or\n        Pre-AIA 35 U.S.C. $102(e)\n        Unless the reference or activity (1) is also a statutory bar or (2) is a U.S. patent or a publication of a pending U.S. application that claims \"interfering subject matter.\""]}, {"tag": "AFFIDAVIT", "patterns": ["AFFIDAVIT"], "responses": ["Affidavits an affidavit is a statement in writing made under oath before a notary public, magistrate, or officer authorized to administer oaths.  See: MPEP $$ 604 through 604.06  and $$ 715 - 719 for details."]}, {"tag": "DECLARATION", "patterns": ["DECLARATION"], "responses": ["Declarations 37 CFR $1.68 permits a declaration to be filed in lieu of an oath/affidavit.  The declaration must include the warning that \"willful false statements and the like are punishable by fine or imprisonment, or both (18 USC $1001), and may jeopardize the validity of the application or any patent issuing thereon.\" The declaration must also state that all statements made of the declarant's own knowledge are true and that all statements made on information and belief are believed to be true."]}, {"tag": "STATUTORY_BAR_EXCLUSION", "patterns": ["STATUTORY BAR EXCLUSION"], "responses": ["The term \"statutory bar\" as used in Rule 131 refers to references and activities which are prior art under pre-AIA 35 USC $102(b), although that term is also sometimes used to describe the \"loss of right\" to a patent under pre-AIA $102(d)."]}, {"tag": "CONCEPTION", "patterns": ["CONCEPTION"], "responses": ["Conception is the formation in the mind of the inventor of a definite and permanent idea of the complete and operative invention as it is to be thereafter applied in practice."]}, {"tag": "ACTUAL_REDUCTION_TO_PRACTICE", "patterns": ["ACTUAL REDUCTION TO PRACTICE"], "responses": ["An actual reduction to practice occurs when the claimed invention is actually made (e.g., an apparatus is assembled) or performed (e.g., for a method) and seen to be suitable for its intended purpose. Being perfected to be commercialized is not required. Requires recognition that an actual reduction to practice has occurred."]}, {"tag": "CONSTRUCTIVE_REDUCTION_TO_PRACTICE", "patterns": ["CONSTRUCTIVE REDUCTION TO PRACTICE"], "responses": ["The term \"constructive reduction to practice\" (CRTP) is used to mean a filing of a US application meeting 35 USC $112(a), written description requirement. If an earlier effective filing date is accorded based upon earlier applications whose benefit has been obtained by satisfying all of the relevant requirements then that is the date of \"CRTP\". Furthermore, an applicant can obtain benefit of an earlier application under $$ 119, 120, 121, and/or 365 only if the earlier application provides section 112(a) support for the claim, which requires that the earlier application disclose every feature of the claim and the full scope of a generic claim. No decision has held that an applicant can obtain the benefit under $$ 119, 120, 121, or 365 of an earlier application which fails to satisfy all of the applicable statutory and regulatory requirements (including $ 112, paragraph (a), written description, support for every feature of the claim and for the entire scope of the claim). Nor has any decision treated an earlier-filed application which fails to qualify as a benefit application under $$ 119, 120, 121, or 365 as a constructive reduction to practice under Rule 131."]}, {"tag": "132", "patterns": ["132"], "responses": ["When any claim of an application or a patent under reexamination is rejected or objected to, any evidence submitted to traverse the rejection or objection on a basis not otherwise provided for must be by way of an oath or declaration under this section. The purpose of Rule 132 is to give applicants a way to provide evidence to overcome a ground of rejection or an objection."]}, {"tag": "DILIGENCE", "patterns": ["DILIGENCE"], "responses": ["Diligence is the reasonable effort to reduce the invention to practice or to file a US application for it. Two types, which can be combined:\n        - Efforts to achieve an actual reduction to practice or to remove obstacles to its development, (\"engineering diligence\"); and\n        - Efforts to prepare and file a patent application, i.e., a constructive reduction to practice (\"attorney diligence\").\n        Proof of reasonable diligence does not require a party to work constantly on the invention or to drop all other work."]}, {"tag": "RESTRICTION", "patterns": ["RESTRICTION", "ELECTION"], "responses": ["Restriction is the practice of requiring an applicant to elect a single claimed invention for examination when two or more independent and/or two or more distinct inventions are claimed in an application.\n        See MPEP $802.02\n\n        Refer to these guides for more details:\n        <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/E9_R-11.2013/d0e97826.html\">Chapter\t800 - Restriction in Applications Filed Under 35 U.S.C. 111; Double Patenting</a>\n\n        <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/E9_R-11.2013/d0e105812.html\">808    Reasons for Insisting Upon Restriction [R-08.2012]</a>\n\n        <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/E9_R-11.2013/d0e98006.html\">802.02   Definition of Restriction [R-08.2012]</a>"]}, {"tag": "MACHINE", "patterns": ["MACHINE"], "responses": ["Parts of devices, Complete devices, or Combinations of Devices."]}, {"tag": "MANUFACTURE", "patterns": ["MANUFACTURE"], "responses": ["Produced Item, or Physical articles or objects."]}, {"tag": "CLAIM", "patterns": ["CLAIM"], "responses": ["A claim is one of the most important parts of the application because. It defines the scope of the protection that the applicant is granted. Every word in the claim MUST be considered, and no limitation, functional or otherwise, can be ignored. All limitations should be specifically addressed in the examination. Claims come in different forms: Apparatus claims, Method or process claims, including methods of making or methods of using, Product claims, and Composition claims."]}, {"tag": "APPARATUS_CLAIM", "patterns": ["APPARATUS CLAIM"], "responses": ["Patentability depends upon the parts or pieces (structure) of the apparatus, not on the way it is used or the material worked upon. See MPEP $ 2114"]}, {"tag": "METHOD_CLAIM", "patterns": ["METHOD CLAIM"], "responses": ["Includes methods of making and methods of using. Patentability depends on the specific steps listed as well as the materials used in the method or process. If the steps are not directly linked to the previous step, then the order of steps doesn't matter (MPEP $ 2111.01 II)"]}, {"tag": "PRODUCT_CLAIM", "patterns": ["PRODUCT CLAIM"], "responses": ["Patentability depends upon the components of the product, not the method or process of making or using the product"]}, {"tag": "COMPOSITION_CLAIM", "patterns": ["COMPOSITION CLAIM"], "responses": ["Patentability depends upon the materials of the composition, not the method or process of making or using the product (See MPEP $ 2112.01)"]}, {"tag": "USE_CLAIM", "patterns": ["USE CLAIM"], "responses": ["\"Use\" claim should be rejected under alternative grounds based on 35 USC $$ 101 and 112(b).\n        - e.g. \"The use of a high carbon austenitic iron alloy having a proportion of free carbon as a vehicle brake part subject to stress by sliding friction.\"\n        - MPEP 2173.05(q)"]}, {"tag": "TRADEMARK_IN_CLAIM", "patterns": ["TRADEMARK IN CLAIM"], "responses": ["Claim [1] contains the trademark/trade name [2]. Where a trademark or trade name is used in a claim as a limitation to identify or describe a particular material or product, the claim does not comply with the requirements of <a target=\"_new\" href=\"https://rdms-mpep-vip.uspto.gov/RDMS/MPEP/current#/current/d0e302824912.html%23%23al_d1d85b_2ae65_215\">35 U.S.C. 112(b)</a>\n  or <a target=\"_new\" href=\"https://rdms-mpep-vip.uspto.gov/RDMS/MPEP/current#/current/d0e302824.html\">pre-AIA 35 U.S.C. 112</a>, second paragraph. See Ex parte Simpson, 218 USPQ 1020 (Bd. App. 1982). The claim scope is uncertain since the trademark or trade name cannot be used properly to identify any particular material or product. A trademark or trade name is used to identify a source of goods, and not the goods themselves. Thus, a trademark or trade name does not identify or describe the goods associated with the trademark or trade name. In the present case, the trademark/trade name is used to identify/describe [3] and, accordingly, the identification/description is indefinite.\n        Trade names may be permissible in patent applications under certain limited conditions. Their meanings are established by an accompanying definition which is sufficiently precise and definite to be made a part of a claim, or In this country, their meanings are well-known and satisfactorily defined in the literature. See MPEP $608.01(v) for form paragraph and additional formatting and language guidelines. If proper identification of the product referred to only by trademark or trade name is omitted from the specification and such identification is deemed necessary, you should hold the disclosure insufficient and reject on the ground of insufficient disclosure any affected claims. If the product cannot be otherwise defined, an amendment defining the process of its manufacture may be permitted."]}, {"tag": "CONTINUED_EXAMINATION", "patterns": ["CONTINUED EXAMINATION", "RCE", "REQUEST FOR CONTINUED EXAMINATION"], "responses": ["Section 4403 of the \"American Inventors Protection Act of 1999\" amends 35 U.S.C. $ 132 to provide, at the request of the applicant, for continued examination of an application for a fee (request for continued examination or RCE practice), without requiring the applicant to file a continuing application under 37 CFR 1.53(b) or a continued prosecution application (CPA) under 37 CFR 1.53(d).\n        To implement RCE practice, the Office has added 37 CFR 1.114 to provide a procedure under which an applicant may obtain continued examination of an application by filing a submission and paying a specified fee, even if the application is under a final rejection, appeal, or a notice of allowance.\n        RCE is a procedure under which an applicant may obtain continued examination of an application in which prosecution is closed, meaning the application is under:\n        - A final rejection or appeal\n        - A notice of allowance, or\n        - An action that otherwise closes prosecution in the application (such as Ex parte Quayle)\n        An RCE is not the filing of a new application\n        An applicant may obtain continued examination of an application by filing a request for continued examination (PTO/SB/30), a submission, and the fee set forth in 37 CFR 1.17(e) prior to the earliest of: a) Payment of the issue fee (unless a petition under 37 CFR 1.313 is granted); b) Abandonment of the application; or c)The filing of a notice of appeal to the U.S. Court of Appeals for the Federal Circuit (CAFC) or the commencement of a civil action (unless the appeal or civil action is terminated)"]}, {"tag": "DERIVATION_101", "patterns": ["DERIVATION 101"], "responses": ["Statutory Categories of Invention, Utility Requirement, Eligible Subject Matter, and Double Patenting"]}, {"tag": "FOUR_REQUIREMENTS_IN_101", "patterns": ["FOUR REQUIREMENTS IN 101"], "responses": ["- \"A\" patent - means only one patent granted for each invention. Basis for statutory double patenting rejections.  See MPEP 804.\n        - \"Useful\" - the invention must have a specific, substantial, and credible utility. \"Utility\" requirement see MPEP 2107 for Utility Guidelines.\n        - \"Process, Machine, Manufacture, Composition of Matter\". \"Subject matter eligibility\" - these categories, as interpreted by the courts, limit the subject matter that is eligible for patenting.\n        - \"Whoever invents or discovers\". A patent may only be obtained by the person who engages in the act of inventing."]}, {"tag": "101_ELIGIBILITY", "patterns": ["101 ELIGIBILITY"], "responses": ["- A: 2014 Interim Eligibility Guidance (Issued Dec. 16, 2014, 79 FR 74618) :\n    - For examination of all claims\n        - Use the broadest reasonable interpretation (BRI) of the claim\n        - Analyze the claim as a whole\n        - Practice compact prosecution by fully examining under 35 U.S.C. $$ 102, 103, 112 and 101 (utility, inventorship, and double patenting) and non-statutory double patenting\n    - Comprehensive view of subject matter eligibility under 35 U.S.C. $ 101 that incorporates teachings from the full body of relevant case law\n    - Reflects recent Supreme Court developments, particularly:\n        - Alice Corp.:  Alice Corp. Pty. Ltd. v. CLS Bank Int'l (2014)\n        - Myriad:  Assoc. for Molecular Pathology v. Myriad Genetics, Inc. (2013)\n        - Mayo:  Mayo Collaborative Services v. Prometheus Labs. Inc. (2012)\n        - Bilski:  Bilski v. Kappos (2010)\n    - July 2015 Update on Subject Matter Eligibility (Issued July 30, 2015, 80 FR 45429).\n        - Provided examples, further explanation of the markedly different characteristics analysis, further information on identifying abstract ideas, discussed the requirements of a prima facie case, and discussed the role of preemption and the streamlined analysis.\n    - May 2016 Update on Formulating a Subject Matter Eligibility Rejection and Evaluating the Applicant's Response to a Subject Matter Eligibility Rejection (Issued May 4, 2016).\n        - Provided further discussion on the content of an eligibility rejection and evaluation of applicant's response.\n    - Memorandum: Recent Subject Matter Eligibility Decisions (Enfish, LLC v. Microsoft Corp. and TLI Communications LLC v. A.V. Automotive LLC), (Issued May 19, 2016).\n        - Discussed the decisions in Enfish (claims found eligible) and TLI (claims found ineligible) with respect to abstract ideas and software-related inventions.\n    - Memorandum: Recent Subject Matter Eligibility Rulings (Rapid Litigation Management v. CellzDirect and Sequenom v. Ariosa), (Issued July 14, 2016)\n        - Discussed the decision in Rapid Litigation Management (claims found eligible) and denial of petition for a writ of certiorari in Sequenom (claims found ineligible) with respect to method claims in the life sciences.\n    - Memorandum: Recent Subject Matter Eligibility Decisions (McRO, Inc. dba Planet Blue v. Bandai Namco Games America Inc. and BASCOM Global Internet Services v. ATT Mobility LLC), (Issued November 2, 2016)\n        - Discussed the decisions in McRo (claims found eligible) and BASCOM (claims found eligible) with respect to computer-related technology."]}, {"tag": "STATUTORY_CATEGORIES_OF_INVENTION", "patterns": ["STATUTORY CATEGORIES OF INVENTION"], "responses": ["Process, Machine, Manufacture, Composition of Matter"]}, {"tag": "COMPOSITION_OF_MATTER", "patterns": ["COMPOSITION OF MATTER"], "responses": ["Chemical Compound, Combinations of Compounds, Composition of substances, or Composite article."]}, {"tag": "UTILITY_REQUIREMENT", "patterns": ["UTILITY REQUIREMENT"], "responses": ["The utility requirement serves to ensure that patents are granted on only those inventions that are \"useful.\" This is determined using a 3-pronged test:\n        - Is there a specific utility\n        - Is there a substantial utility; and\n        - Is there a credible utility?\n        Rejections for lack of utility should not normally be based on a determination that the invention is frivolous, fraudulent, or against public policy. (Consult SPE if this applies)"]}, {"tag": "SPECIFIC_UTILITY", "patterns": ["SPECIFIC UTILITY"], "responses": ["A utility is specific, if it is particular to the subject matter claimed. This contrasts with a general utility that would be applicable to the broad class of the invention.\n        For example:\n        - Providing a general statement of diagnostic utility, such as diagnosing an unspecified disease, would ordinarily be insufficient absent a disclosure of what condition can be diagnosed.\n        - Use of a protein as a \"shampoo ingredient\" would ordinarily be insufficient as proteins generally as a class can provide this utility.\n        - Providing a statement of a particular biological activity (e.g., sedative or paralytic activity) for a compound is a specific utility."]}, {"tag": "SUBSTANTIAL_UTILITY", "patterns": ["SUBSTANTIAL UTILITY"], "responses": ["A utility that defines a \"real world\" use\n        - Utilities that require or constitute carrying out further research to identify or reasonably confirm a \"real world\" context of use are not substantial utilities."]}, {"tag": "CREDIBLE_UTILITY", "patterns": ["CREDIBLE UTILITY"], "responses": ["An assertion is credible unless (A) the utility is unbelievable (incredible utility), or (B) the claimed invention is wholly inoperative. Incredible Utility: An assertion of utility is credible unless the logic underlying the assertion is seriously flawed, or the facts upon which the assertion is based are inconsistent with the logic underlying the assertion. A credible utility is assessed from the standpoint of whether a person of ordinary skill in the art would accept that the recited or disclosed invention is currently available for such use. For example, one skilled in the art would not accept that a device could be used to generate more energy than it consumes or that a device could be used with at least 100% efficiency."]}, {"tag": "WELL_ESTABLISHED_UTILITY", "patterns": ["WELL ESTABLISHED UTILITY"], "responses": ["A specific, substantial, and credible utility which is well known, immediately apparent, or implied by the specification's disclosure of the properties of a material, alone or taken with the knowledge of one skilled in the art. \"Well established utility\" does not encompass any \"throw away\" utility that one can dream up for an invention or a nonspecific utility that would apply to virtually every member of a general class of materials."]}, {"tag": "UTILITY_REJECTION_OVERVIEW", "patterns": ["UTILITY REJECTION OVERVIEW"], "responses": ["If a well-established utility is apparent from the application, do not reject for lack of utility.\n        If no well-established utility is apparent, review the application for an asserted specific, substantial, and credible utility. If no specific and substantial utility is credible, then reject the claim(s) as lacking utility.\n        - Rejection shifts the burden to applicant to provide rebuttal arguments and/or supporting evidence.\n        - Rejection is made under both 35 U.S.C. 101 and 112(a), as lacking utility and lacking enablement. Rejection under both sections is required, because if there is no utility, the applicant has necessarily failed to enable the public to make and use the invention.\n        - The rejection should include enough explanation to provide a clear record of the examiner's determination."]}, {"tag": "UTILITY_DECISION_TREE", "patterns": ["UTILITY DECISION TREE"], "responses": ["Identify what applicant has claimed as the invention. Does the invention have a well-established utility?\n        - Yes -> No rejection; continue with examination\n        - No -> Proceed with analysis\n        Has the applicant made any assertion of utility for the claimed invention?\n        - Yes -> Proceed with analysis\n        - No -> Reject claimed invention under 35 U.S.C. $$101 and 112(a), for lack of enablement. \"Applicant has not disclosed any specific and substantial utility for the claimed invention\" (provide explanation)\n        Does the assertion identify a specific utility?\n        - Yes -> Continue with analysis\n        - No -> Reject claimed invention under 35 U.S.C. $$101 and 112(a), for lack of enablement. \"Applicant has not disclosed any specific and substantial utility for the claimed invention\" (provide explanation)\n        Does the assertion identify a substantial utility?\n        - Yes -> Continue with analysis\n        - No -> Reject claimed invention under 35 U.S.C. $$101 and 112(a), for lack of enablement. \"Applicant has not disclosed any specific and substantial utility for the claimed invention\" (provide explanation)\n        Is the assertion of specific and substantial utility credible?\n        - Yes -> No rejection; continue with examination\n        - No -> Reject claimed invention under 35 U.S.C. $$101 and 112(a), for lack of enablement. \"Applicant has disclosed at least one specific and substantial utility for the claimed invention, but the assertion is not credible\" (provide explanation)"]}, {"tag": "DOUBLE_PATENTING", "patterns": ["DOUBLE PATENTING"], "responses": ["35 USC $101 states in the singular that an inventor \"may obtain a patent therefor\"\n        - Statutory Double Patenting Rejection - applies when the same invention is claimed in two pending applications, or in a pending application and a patent\n        - Non-Statutory type Double Patenting Rejection - applies when e.g. obvious variants are claimed in two pending applications, or in a pending application and a patent\n        See MPEP $804 et seq. for further information"]}, {"tag": "UNEXPECTED_RESULTS_AFFIDAVIT", "patterns": ["UNEXPECTED RESULTS AFFIDAVIT"], "responses": ["37 CFR $1.132 affidavits are frequently submitted to rebut a rejection establishing a prima facie case of obviousness under 35 USC $103. A prima facie case of obviousness may be rebutted by evidence establishing that applicant's invention produces unexpected results. The affidavit should present a comparison with the closest prior art. The comparison must be under identical conditions except for the novel features of the invention. The unexpected property or result must actually be unexpected and of statistical and practical significance. The unexpected property or result must be disclosed or inherent in the specification. Unexpected properties do not necessarily have to be claimed to be considered. The scope of the showing must be commensurate with the scope of the claimed subject matter. Synergism is merely a property like any other property, it may be expected or unexpected depending on the particular art. \"Unexpected results\" is a secondary consideration with respect to obviousness. It is not relevant to anticipation under 35 USC $102."]}, {"tag": "COMMERCIAL_SUCCESS_AFFIDAVIT", "patterns": ["COMMERCIAL SUCCESS AFFIDAVIT"], "responses": ["The affidavit must establish a nexus between the novel features of the claimed invention and the commercial success. The showing of commercial success must be commensurate with the scope of the claims. The best showing is that the invention has displaced competitor's product in the market place. \"Commercial success\" is a secondary consideration with respect to obviousness. It is not relevant to anticipation under 35 USC $102"]}, {"tag": "LONG_FELT_NEED_AFFIDAVIT", "patterns": ["LONG FELT NEED AFFIDAVIT"], "responses": ["The evidence must establish an art recognized problem that has existed for a long period without solution. The evidence must show that the claimed invention actually solved the problem. The existence of a prior art reference showing a solution to the problem is evidence that there is no long felt need. \"Long felt need\" is a secondary consideration with respect to obviousness. It is not relevant to anticipation under 35 USC $102."]}, {"tag": "SHORTENED_STATUTORY_PERIOD", "patterns": ["SHORTENED STATUTORY PERIOD"], "responses": ["3 months from the date the final rejection is mailed. Can be extended up to additional 3 months with a petition and appropriate fee (MPEP 706.07(f), III)"]}, {"tag": "EX_PARTE_QUAYLE_ACTION", "patterns": ["EX PARTE QUAYLE ACTION"], "responses": ["An Ex parte Quayle action may be issued when the after final reply places the application in condition for allowance except for formal matters which: Are identified for the first time after a reply is made to a final Office action, AND require action by applicant to correct. Extension of time fees are not required. Consider an examiner's amendment to resolve formal matters when possible"]}, {"tag": "312_AMENDMENT", "patterns": ["312 AMENDMENT"], "responses": ["Amendments after allowance are governed by 37 C.F.R. 1.312. Encompasses any amendment by applicant after allowance. Not made as a matter of right. Will show up on \"Expedited\" tab. Most common reasons for filing a 312 amendment are formal corrections such as typographical errors, grammatical mistakes."]}, {"tag": "APPEAL_BRIEF", "patterns": ["APPEAL BRIEF"], "responses": ["Appellant has 2 months following the filing of a notice of appeal to file an appeal brief. If appellant filed a pre-appeal brief conference request, the time of filing a signed appeal brief is one month from the date of the panel decision, or two months from the filing of the notice of appeal, whichever is longer. The time period may be extended an additional 5 months [37 CFR $1.136(a)]. The appeal brief must be signed. The Patent Appeal Center will: Check for timeliness (If the appeal brief is not timely filed, the Patent Appeal Center will process form PTOL-461 (Communication Regarding Appeal)) and Message PTAB for review and entry of the appeal brief"]}, {"tag": "APPEAL_FORWARDING_FEE", "patterns": ["APPEAL FORWARDING FEE"], "responses": ["Appellant must pay the appeal forwarding fee within the later of two months of the date of the examiner's answer or a decision refusing to grant a petition under 37 CFR $1.181 to designate a new ground of rejection in the examiner's answer [37 CFR $41.45(a)]. Failure to pay the fee set forth in 37 CFR $41.20(b)(4) will result in dismissal of the appeal. After dismissal, the Tech Center will determine whether any allowable claims remain in the application or determine that the application stands abandoned. The period set forth in $41.45(a) cannot be extended by paying for an extension of time under 37 CFR $1.136(a)"]}, {"tag": "ORAL_HEARING", "patterns": ["ORAL HEARING"], "responses": ["If appellant desires an oral hearing, appellant must file a written request, as a separate paper captioned \"REQUEST FOR ORAL HEARING\". The request and must be accompanied by the fee required by $41.20(b)(3). Appellant must file the request within the earlier of two months from the date of the examiner's answer or on the date of filing the reply brief. The primary examiner may present an oral argument at the hearing. Request on a Form PTOL-90 using FP 12.279.03 (MPEP $1209 and 37 CFR $41.47)"]}, {"tag": "BROADEST_REASONABLE_INTERPRETATION", "patterns": ["BROADEST REASONABLE INTERPRETATION"], "responses": ["Claims must be given their broadest reasonable interpretation (BRI) consistent with the supporting description (specification). Broadest reasonable interpretation leads to consideration of the following:\n        - Plain meaning of claim terms\n        - Explicit definitions, if any, in the specification\n        - Functional language\n            o Intended use statements\n            o Wherein/whereby clauses\n            o Capability\n        Broadest reasonable interpretation by the examiner reduces the possibility that the claim, once issued, will be interpreted more broadly than is justified. Applicant has the opportunity to amend the claims during prosecution. The USPTO's interpretation of claims in applications differs from how a court interprets claims an infringement case of an issued patent."]}, {"tag": "PLAIN_MEANING", "patterns": ["PLAIN MEANING"], "responses": ["Words and phrases in claims must be given their \"plain meaning\" as understood by one having ordinary skill in the art unless such meaning is inconsistent with a clearly expressed redefinition stated in the specification. The ordinary and customary meaning of a claim term is the meaning that the term would have to a person of ordinary skill in the art in question at the time of the invention, i.e., as of the effective filing date of the patent application."]}, {"tag": "FUNCTIONAL_LIMITATION", "patterns": ["FUNCTIONAL LIMITATION"], "responses": ["A functional limitation is an attempt to define something by what it does, rather than by what it is (e.g., as evidenced by its specific structure or specific ingredients). A functional limitation is often used in association with an element, ingredient, or step of a process to define a particular capability or purpose that is served by the recited element, ingredient or step (MPEP $2173.05(g))"]}, {"tag": "INTENDED_USE_LIMITATION", "patterns": ["INTENDED USE LIMITATION"], "responses": ["An intended use statement may be found within the body of the claim or in the preamble. An intended use limitation may impart a structural limitation that is otherwise not found in the claim language, i.e., the reference may meet all recited structural limitations but still might not be capable of performing the intended use (MPEP $ 2111.02 (II); and Metabolite Labs., Inc. v. Corp. of Am. Holdings, 370 F.3d 1354, 1358-62, 71 USPQ2d 1081, 1084-87 (Fed. Cir. 2004).)\n        Examples of Intended Use Phrases:\n        Claim limitations that employ phrases of the type:\n        - \"ADAPTED TO\"\n        - \"CAPABLE OF\"\n        - \"SUFFICIENT TO\"\n        - \"FOR\" doing something\n        are typical of claim limitations which may not distinguish over prior art according to the principle of intended use. It has been held that the recitation that an element is \"ADAPTED TO\" perform or is \"CAPABLE OF\" performing a function is not a positive limitation but only requires the ability to so perform"]}, {"tag": "COMPACT_PROSECUTION", "patterns": ["COMPACT PROSECUTION"], "responses": ["Compact Prosecution is:\n        - Conducting an initial search which is as complete as possible;\n        - Citing pertinent art on the record in keeping with the scope of the claims as well as significant aspects of the disclosed invention;\n        - Issuing a complete first Office action on the merits which clearly explains the examiner's position on each essential issue; and\n        - Identifying allowable subject matter in an effort to expedite prosecution"]}, {"tag": "CLARITY", "patterns": ["CLARITY"], "responses": ["Clarity means fully conveying the positions being taken. An Office action is written for a varied audience. An Examiner is responsible for creating a clear, understandable and factually correct record."]}, {"tag": "MANUAL_OF_PATENT_EXAMINING_PROCEDURE", "patterns": ["MANUAL OF PATENT EXAMINING PROCEDURE", "MPEP"], "responses": ["This Manual is published to provide U.S. Patent and Trademark Office (USPTO) patent examiners, applicants, attorneys, agents, and representatives of applicants with a reference work on the practices and procedures relative to the prosecution of patent applications before the USPTO. The MPEP outlines the current procedures that patent examiners are required or authorized to follow in the normal examination of a patent application. The MPEP itself does not have the force of law (U.S. Code) or rules (Code of Federal Regulations)"]}, {"tag": "MPEP_STATUTES", "patterns": ["MPEP STATUTES"], "responses": ["Patent Laws passed by Congress"]}, {"tag": "MPEP_REGULATIONS", "patterns": ["MPEP REGULATIONS"], "responses": ["Patent Rules the USPTO has established and must follow except in extraordinary situations"]}, {"tag": "MPEP_CASE_LAW", "patterns": ["MPEP CASE LAW"], "responses": ["Decisions made by judicial bodies. The MPEP contains case law that is relevant to USPTO policy. Cases are discussed in the MPEP by relevant topics and in Appendix II, List of Decisions Cited. The MPEP is the best source of case law for examiners and should always be consulted first. But, the MPEP is just a summary; it may be necessary to go beyond the MPEP and read the actual case to fully understand it"]}, {"tag": "MPEP_POLICY", "patterns": ["MPEP POLICY"], "responses": ["Detailed guidance regarding operations of the USPTO"]}, {"tag": "MPEP_GUIDELINES", "patterns": ["MPEP GUIDELINES"], "responses": ["Comprehensive analyses of individual topics. Guidelines do not have the force of statutes, court opinions, or regulations, but represent the manner in which the USPTO has directed its staff to implement USPTO policy on the discrete topics."]}, {"tag": "MPEP_FORM_PARAGRAPHS", "patterns": ["MPEP FORM PARAGRAPHS"], "responses": ["Prewritten templates that examiners use to convey information to applicants and attorneys. Form paragraphs are templates addressing commonly occurring issues for use when communicating such issues to outside parties. Use of form paragraphs promotes: Efficiency (No reinventing the wheel), Consistency (Same situation handled same way), Completeness (Paragraphs identify all needed items). Form paragraphs are quoted in multiple locations in the MPEP (within chapters and also consolidated in Form Paragraph Book)"]}, {"tag": "ANTICIPATION", "patterns": ["ANTICIPATION"], "responses": ["When a single prior art reference describes, either expressly or inherently, each and every limitation of a claim. A single prior art reference anticipates the claimed invention by describing every limitation in the claim. The limitations may either be set forth expressly or be inherently present in the prior art reference"]}, {"tag": "EVIDENCE_TYPE", "patterns": ["EVIDENCE TYPE"], "responses": ["- References - Printed documents, including patents (domestic and foreign) and other printed publications (non-patent literature, known as NPL); see MPEP 2126-2128\n        - Admissions - Statements by applicants that certain information was prior art to the inventor; see MPEP 2129\n        - Affidavits and Declarations - Evidence may be provided of knowledge and activity that constitute prior art - i.e. \"sworn evidentiary statements\"\n        - Knowledge in the Art - which may be evidenced by logical reasoning or common knowledge; see MPEP 2144 (such evidence is often made \"of record\" by \"taking official notice;\" see MPEP 2144.03)"]}, {"tag": "ACTUAL_FILING_DATE", "patterns": ["ACTUAL FILING DATE"], "responses": ["The date upon which the application is filed with the USPTO"]}, {"tag": "PRIORITY_DATE", "patterns": ["PRIORITY DATE"], "responses": ["The application may be entitled to the benefit of the filing date of an earlier foreign application if certain conditions are met"]}, {"tag": "DOMESTIC_BENEFIT", "patterns": ["DOMESTIC BENEFIT"], "responses": ["An application for patent, provided certain conditions are met, is entitled to the benefit of the filing date of: a prior non-provisional application under 35 U.S.C. $120 or $121, a provisional application under 35 U.S.C. $119(e), or an international (PCT) application designating the U.S. under 35 U.S.C. $365(c). See MPEP $211 for conditions required for the benefit claim"]}, {"tag": "DOMESTIC_BENEFIT_CLAIMED", "patterns": ["DOMESTIC BENEFIT CLAIMED"], "responses": ["A reference to the prior non-provisional or provisional application must be made in the Application Data Sheet (ADS) filed by the applicant. Note: For applications filed before September 16, 2012, domestic benefit claims are permitted to be made in the first sentence(s) of the specification following the title, or in an ADS. There must be a continuous chain of copendency to the earliest claimed filing date (See MPEP $211.01(b)). Consecutive applications must have at least one common inventor. Claimed subject matter must have support continuously all the way back to the earliest claimed filing date to get benefit of that date."]}, {"tag": "NONPROVISIONAL_APPLICATION", "patterns": ["NONPROVISIONAL APPLICATION"], "responses": ["Initiates examination process. Establishes filing date. If granted, carries legal rights to exclude others from making, using, offering for sale, selling, or importing the claimed invention, for a limited time. Must include: Specification including at least one claim, Drawings (if necessary), Oath or declaration, and The appropriate fees"]}, {"tag": "PROVISIONAL_APPLICATION", "patterns": ["PROVISIONAL APPLICATION"], "responses": ["Low-cost submission to establish filing date. Provisional applications are not examined. Automatic abandonment after one year. Inventor given time to investigate market potential and/or make improvements. The term patent pending can be applied. Inventors may use this term during the time period after the patent application (provisional, nonprovisional, design, or plant) has been filed, but before the patent has been issued."]}, {"tag": "PATENT_COOPERATION_TREATY", "patterns": ["PATENT COOPERATION TREATY", "PATENT COOPERATION TREATY"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e163752.html\">Patent Cooperation Treaty</a>"]}, {"tag": "REISSUE_APPLICATION", "patterns": ["REISSUE APPLICATION"], "responses": ["Special type of application in which a granted patent is offered for surrender for additional examination. Filed to correct an error in the patent that was made without any deceptive intent and where, as a result of the error, the patent is deemed wholly or partly inoperative or invalid (See MPEP 1402, 1416)"]}, {"tag": "REISSUE_PATENT", "patterns": ["REISSUE PATENT"], "responses": ["Reissued patent may result in newly defined patent rights, for example by amendments to the claims. Reissue permitted for only the unexpired portion of the term of the original patent."]}, {"tag": "112", "patterns": ["112"], "responses": ["It is type of rejection based on whether or not the claimed subject matter (under 112(a) written description - is supported by the specification to show the inventor had possession of the claimed subject matter) or (112(a) - is sufficiently enabled such that one of ordinary skill in the art could make and use without undue experimentation) or 112(b) - whether the claims are sufficiently definite to understand the \"metes and bounds\" of what is being claimed"]}, {"tag": "112A", "patterns": ["112A"], "responses": ["(a) IN GENERAL The specification shall contain a written description of the invention, and of the manner and process of making and using it, in such full, clear, concise, and exact terms as to enable any person skilled in the art to which it pertains, or with which it is most nearly connected, to make and use the same, and shall set forth the best mode contemplated by the inventor or joint inventor of carrying out the invention.\n\n        It is type of rejection based on whether or not the claimed subject is sufficiently enabled such that one of ordinary skill in the art could make and use without undue experimentation.\n        The specification shall contain a written description of the invention, and of the manner and process of making and using it, in such full, clear, concise, and exact terms as to enable any person skilled in the art to which it pertains, or with which it is most nearly connected, to make and use the same, and shall set forth the best mode contemplated by the inventor or joint inventor of carrying out the invention."]}, {"tag": "112D", "patterns": ["112D"], "responses": ["(d) REFERENCE IN DEPENDENT FORMS.â\u0080\u0094Subject to subsection (e), a claim in dependent form shall contain a reference to a claim previously set forth and then specify a further limitation of the subject matter claimed. A claim in dependent form shall be construed to incorporate by reference all the limitations of the claim to which it refers.\n\n        35 U.S.C. $112(d) states in pertinent part: [A] claim in dependent form shall contain a reference to a claim previously set forth and then specify a further limitation of the subject matter claimed. A claim in dependent form shall be construed to incorporate by reference all the limitations of the claim to which it refers. For example: Claim 1. A product comprising [recites limitations A, B, C, and D]. Claim 2. The product of claim 1 which further comprises [E].\n        Under 35 U.S.C. $112(d), a dependent claim is required to: Contain a reference to a previous claim, and Specify a further limitation of the subject matter claimed. If it does not satisfy these requirements, the claim should be rejected under 35 U.S.C. $112(d), rather than being objected to, and then examined on the merits. (MPEP $608.01(n)(II and III))"]}, {"tag": "112E", "patterns": ["112E"], "responses": ["(e) REFERENCE IN MULTIPLE DEPENDENT FORM.â\u0080\u0094A claim in multiple dependent form shall contain a reference, in the alternative only, to more than one claim previously set forth and then specify a further limitation of the subject matter claimed. A multiple dependent claim shall not serve as a basis for any other multiple dependent claim. A multiple dependent claim shall be construed to incorporate by reference all the limitations of the particular claim in relation to which it is being considered."]}, {"tag": "BILSKI", "patterns": ["BILSKI"], "responses": ["Bilski v. Kappos, 561 U.S. 593 (2010), was a case decided by the Supreme Court of the United States holding that the machine-or-transformation test is not the sole test for determining the patent eligibility of a process, but rather \"a useful and important clue, an investigative tool, for determining whether some claimed inventions are processes under Â§ 101.\"[1] In so doing, the Supreme Court affirmed the rejection of an application for a patent on a method of hedging losses in one segment of the energy industry by making investments in other segments of that industry, on the basis that the abstract investment strategy set forth in the application was not patentable subject matter."]}, {"tag": "INFORMATION_DISCLOSURE_STATEMENT", "patterns": ["INFORMATION DISCLOSURE STATEMENT", "IDS"], "responses": ["An information disclosure statement (often abbreviated as IDS) refers to a submission of relevant background art or information to the United States Patent and Trademark Office (USPTO) by an applicant for a patent during the patent prosecution process. There is a duty on all patent applicants to disclose prior art or background information that may be relevant to the patentability of the applicant's invention, as established by the United States Code title 35 and related sections of 37 CFR and the Manual of Patent Examining Procedure (MPEP). If a patent applicant knowingly or intentionally fails to submit prior art to the USPTO, then any patent that later issues from the patent application may be declared unenforceable. Furthermore, the duty to submit such relevant information to the USPTO lies not only on the applicant or inventor, but also on any patent attorney or other legal staff employed by the applicant."]}, {"tag": "PTO_892", "patterns": ["PTO 892"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://www.uspto.gov/web/offices/pac/mpep/s707.html\">PTO-892</a>"]}, {"tag": "APPLICATION_DATA_SHEET", "patterns": ["APPLICATION DATA SHEET"], "responses": ["You can find it here: <a target=\"_new\" href=\"https://www.uspto.gov/patents-application-process/applying-online/form-fillable-pdfs-available\">APPLICATION DATA SHEET</a>"]}, {"tag": "METES_AND_BOUNDS", "patterns": ["METES AND BOUNDS"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://www.uspto.gov/web/offices/pac/mpep/s2173.html\">METES AND BOUNDS</a>"]}, {"tag": "MAINTENANCE_FEES", "patterns": ["MAINTENANCE FEES"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e247906.html\">Maintenance Fees</a>"]}, {"tag": "FEES", "patterns": ["FEES", "FEE"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://rdms-mpep-vip.uspto.gov/RDMS/MPEP/current#/current/eff_20130320_d0e315199.html\">Fees</a>"]}, {"tag": "DUTY_OF_DISCLOSURE", "patterns": ["DUTY OF DISCLOSURE"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e195418.html\">Duty of Disclosure</a>"]}, {"tag": "SECRECY", "patterns": ["SECRECY", "ACCESS", "NATIONAL SECURITY", "FOREIGN FILING"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e405.html\">SECRECY, ACCESS, NATIONAL SECURITY, AND FOREIGN FILING</a>"]}, {"tag": "STATUS_OF_APPLICATION", "patterns": ["STATUS OF APPLICATION", "TYPES"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e4510.html\">TYPES, CROSS-NOTING, AND STATUS OF APPLICATION</a>"]}, {"tag": "CROSS_NOTING", "patterns": ["CROSS NOTING"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e4510.html\">TYPES, CROSS-NOTING, AND STATUS OF APPLICATION</a>"]}, {"tag": "OWNERSHIP", "patterns": ["OWNERSHIP", "ASSIGNMENT"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e17683.html\">OWNERSHIP AND ASSIGNMENT</a>"]}, {"tag": "REPRESENTATIVE_OF_APPLICANT", "patterns": ["REPRESENTATIVE OF APPLICANT", "OWNER"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e20478.html\">REPRESENTATIVE OF APPLICANT OR OWNER</a>"]}, {"tag": "RECEIPT_HANDLING_MAIL_PAPERS", "patterns": ["RECEIPT HANDLING MAIL PAPERS", "RECEIPT * HANDLING * MAIL * PAPERS", "HANDLING * MAIL * PAPERS", "HANDLING * PAPERS", "HANDLING * MAIL"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e24253.html\">RECEIPT AND HANDLING OF MAIL AND PAPERS</a>"]}, {"tag": "PARTS_OF_APPLICATION", "patterns": ["PARTS OF APPLICATION", "FORM OF APPLICATION", "CONTENT OF APPLICATION"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e34301.html\">PARTS, FORM, AND CONTENT OF APPLICATION</a>"]}, {"tag": "EXAMINATION_OF_APPLICATIONS", "patterns": ["EXAMINATION OF APPLICATIONS", "EXAMINATION OF APPLICATION"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e55397.html\">EXAMINATION OF APPLICATIONS</a>"]}, {"tag": "RESTRICTION_IN_APPLICATIONS", "patterns": ["RESTRICTION IN APPLICATIONS"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e97826.html\">RESTRICTION IN APPLICATIONS FILED UNDER 35 U.S.C. 111; DOUBLE PATENTING</a>"]}, {"tag": "MATTERS_DECIDED_BY_VARIOUS_US_PATENT_AND_TRADEMARK_OFFICE_OFFICIALS", "patterns": ["MATTERS DECIDED BY VARIOUS US PATENT AND TRADEMARK OFFICE OFFICIALS", "MATTERS DECIDED OFFICIALS", "MATTERS DECIDED"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e115995.html\">MATTERS DECIDED BY VARIOUS U.S. PATENT AND TRADEMARK OFFICE OFFICIALS</a>"]}, {"tag": "STATUTORY_INVENTION_REGISTRATION", "patterns": ["STATUTORY INVENTION REGISTRATION", "SIR", "PRE GRANT PUBLICATION", "PGPUB", "PREISSUANCE SUBMISSIONS"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e4051.html\">Statutory Invention Registration (SIR); Pre-Grant Publication (PGPub) and Preissuance Submissions</a>"]}, {"tag": "APPEAL", "patterns": ["APPEAL"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e122292.html\">Appeal</a>"]}, {"tag": "CORRECTION_OF_PATENTS", "patterns": ["CORRECTION OF PATENTS", "CORRECTION"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e134581.html\">Correction of Patents</a>"]}, {"tag": "MISCELLANEOUS", "patterns": ["MISCELLANEOUS"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"link\">Miscellaneous</a>"]}, {"tag": "PROTEST", "patterns": ["PROTEST"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e193631.html\">Protest</a>"]}, {"tag": "PATENTABILITY", "patterns": ["PATENTABILITY"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e197004.html\">Patentability</a>"]}, {"tag": "INTERFERENCE_PROCEEDINGS", "patterns": ["INTERFERENCE PROCEEDINGS"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e237627.html\">Interference Proceedings</a>"]}, {"tag": "BIOTECHNOLOGY", "patterns": ["BIOTECHNOLOGY"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e240552.html\">Biotechnology</a>"]}, {"tag": "OPTIONAL_INTER_PARTES_REEXAMINATION", "patterns": ["OPTIONAL INTER PARTES REEXAMINATION"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e249708.html\">Optional Inter Partes Reexamination</a>"]}, {"tag": "PATENT_TERMS", "patterns": ["PATENT TERMS", "EXTENSIONS"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e271941.html\">Patent Terms and Extensions</a>"]}, {"tag": "SUPPLEMENTAL_EXAMINATION", "patterns": ["SUPPLEMENTAL EXAMINATION"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/ch2800_d1fea8_279ab_9.html\">Supplemental Examination</a>"]}, {"tag": "INTERNATIONAL_DESIGN_APPLICATIONS", "patterns": ["INTERNATIONAL DESIGN APPLICATIONS"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"link\">International Design Applications</a>"]}, {"tag": "PATENT_LAWS", "patterns": ["PATENT LAWS"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e300730.html\">Patent Laws</a>"]}, {"tag": "PATENT_RULES", "patterns": ["PATENT RULES"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e312906.html\">Patent Rules</a>"]}, {"tag": "PARIS_CONVENTION", "patterns": ["PARIS CONVENTION"], "responses": ["Refer to this guide: <a target=\"_new\" href=\"https://mpep.uspto.gov/RDMS/MPEP/current#/current/d0e311120.html\">Paris Convention</a>"]}]}